{
    "heading": [
        "How about, fuckin'...",
        "Check this shit out",
        "Fuckin' maybe..."
    ],

    "response": [
        "Already fucking seen that one",
        "Give me a-fucking-nother one",
        "Don't really give a fuck",
        "That's fucking lame",
        "That doesn't fit my fucking campaign"
    ],

    "template": [
        "The players come across another party of adventurers, they are carrying what looks like meat and have some cool items from the local area. If the party is friendly they share camp for the night the party is well fed, shared drink and the other party leaves in the morning.",
"The party comes across a small tower, if the players knock a local (of that area) wizard answers and berates them for interrupting his important research, there is a small explosion and he curses, slamming the door, they can hear him rushing around. If the players break in the wizard screams at them to get out as an explosion takes place from a table. After he comes out furious telling them off.",
"This one is shamelessly taken from somewhere else on Reddit (I've used it): the party find a dozen dead bandits there is a cat cleaning his claws atop a corpse, it appears this would have been an ambush. The cat says \"you saw nothing\" in a Scottish accent giving one of them a satchel of silver (enough for 2 SP each), and vanishes.",
"The party comes across an orc stronghold. The orc patrol catches them, is friendly but asks them to steer clear of the area.",
"The party finds a small clearing where it looks like druids practiced some sort of spell.",
"The party sees a large bear up ahead, if they let it pass, the bear continues on without incident. Otherwise it protects itself while trying to run.",
"The party finds an adventurers kit, there are some expired rations, a short sword, a handful of coins, some arrows and a scroll of fireball. There's a scorch mark nearby.",
"The party sees two giants of different type (I used frost and hill when my party was in the mountains) fighting off in the distance. They are far enough off that the party has no issue avoiding them.",
"The party finds an active bandit raid in progress on a trading cart. If the party assists the traders they are paid a fair sum, and asked to assist in fixing the cart and accompany the merchant to the next town.",
"The party comes across a pair of elves hunting wildlife for their tribe. They usher the party along their merry way. (I used this in an arctic setting using it to introduce snow elves).",
"Traveling through a marsh, the party might notice a serpent stalking them, and it might attack, but another creature, such as a giant hawk might come and attack the serpent, leaving those two to battle while the two animals duke it out",
"Coming across some curious and afraid firbolg druids in the forest, and they kind of pick at the party in a non-harming fashion, kind of like ewoks in return of the jedi",
"A wandering golem of any kind that is just walking. No matter what is in its direct path, it just keeps walking in one direction",
"A vine-covered iron golem whose eyes are still glowing from the power of the soul gem encased in it, but it’s unresponsive",
"A traveling preacher who is basically a jehovah’s witness for whatever god they worship",
"A band of hunter’s tracking their prey, and telling the party that they should not be in this area, and should leave immediately, followed by the roar of something big and bad and the hunters then rushing off towards the noise.",
"Two nobles are getting ready to have a duel in a nearby field - the matter at hand is a question of honor, and one of the nobles has demanded satisfaction from the other. The nobles may ask the party's cleric (if they have one) to act as a witness and to provide medical attention.",
"Some local tribesmen are in the middle of cattle raid. They're not violent - around here, cattle raiding is sort of the national sport.",
"A holy mystic sits by the side of the road with a begging bowl. If the players donate some gold, he may bless them.",
"A dragon flies overhead, too high up to identify and too fast to track.",
"A flying city (your decision on what its nature is, I like cities of air spirits or a palace of the gods) is parked in the sky. A tent city of curious ground dwellers (pilgrims, merchants, or just nosy locals) has sprung up on the ground beneath it, with everyone waiting to see what happens next.",
"A circle of stones or toadstools sits in the wilderness. If the party stays there overnight, they are confronted by a band of Fey, who may or may not be hostile. Gods help them if they sleep inside the circle, though.",
"A holy shrine to some very minor god or goddess is untended. On it lie some offerings - a handful of coins, some flowers, a piece of fruit.",
"A small army of orc mercenaries is camped outside of town. They're working for the local ruler, but if they don't see battle soon they may get bored and start pillaging the countryside in search of something to do.",
"A drunken philosopher sleeps in a barrel by the side of the road. If roused from his slumber, he'll eagerly debate the players about his philosophy, which may or may not be coherent.",
"A traveler from a distant land is visiting this one and writing down his experiences in a book. If questioned he will gladly tell the players about his travels across the length of the continent, with astounding tales of the people and places he has seen. His stories may or may not be true, accurate, or helpful.",
"In the open fields the party encounters a group of migrating large herbivores they stay calm if the party doesn't get too close. Also there is a chance they will spot predators stalking the younger beasts.",
"Child with an exceptional turtle named Oliver, which has fallen down a ravine",
"A talking hat that wishes to be reunited with its owner, Fizban the old wizard. It was blown off the wizards head from the top of a tall tower nearby.",
"Traveling yuan-ti purebloods disguised as gypsies. May be bartered with for cheap magical items (socks of warming, broom of sweeping, ect.)",
"In a cloud of fog, you find a goblin camp with a Minotaur in a cage on the side. If freed, it slaughters the goblins and leaves.",
"Vampire Ghandi. Wouldn’t hurt a fly, accepts blood donations.",
"Collossal, somewhat furry land-whales. Not easily hurt or spooked, but may require saving throws to avoid being crushed. Deafeningly loud whale-call.",
"Ogre named Rolok with a sentient sword named Dia that talks him out of attacking.",
"A knight who rescued the princess for platonic reasons, and can't seem to politely get her to stop following him and insisting on marriage.",
"Mage trying to lure a wyvern out of some woods so he can control it with a magical charm. Will need one uninterrupted round to gain control.",
"Pack of wolves led by a dire wolf, will flee if dire wolf is killed",
"A fairie dragon who flings a beehive and laughs. May or may not reward good humor with a potion/scroll.",
"A farmers' wife named Agnes yelling at a donkey. The donkey yells back.",
"A group of soldiers demanding a toll to use a bridge, which is a shortcut. If you don't use it, roll random encounter again.",
"A magic ring with a note that says \"do not touch!\" The wearer is forced to punch whoever is closest, dealing 1d4+str bludgeoning damage",
"An eccentric gnome named Barnibus who is tracking a nearby flail snail. He secretly doesn't have the heart to kill the thing for its shell.",
"River crossing with broken bridge, nearby inn taking up collection to get it fixed. If you donate, a kind young man offers to ferry you across. If not, detour and reroll random encounter.",
"Cranky old halfling named Old Dorrow with a heavy crossbow, orders you off his lawn from the window of his hut which may or may not be on the back of a giant crab. If you detour, roll another encounter.",
"A farmer named Garreth who saw a purple worm once long ago and won't shut up about it. Thinks it's gonna pop up out of the ground and tear up his farm. \"Mind the wooooorm!\"",
"Ranchers (head rancher named Est Clintwood) need help getting a herd of cattle into their pens. Skill check with animal handling and athletics.",
"Wake up after sleeping and see two of your weapon/equipment/ect. One is a mimic.",
"Two small bulette, if you mess with them, the mother shows up and attacks.",
"Cyclops clutching supercially wounded eye and sobbing, doesn’t yet realize he’s not blind.",
"A gnome named Tingle, dressed in green, attached to a red balloon, floating above the ground. He's a cartographer seeking information to complete his maps.",
"A powerful storm blows over, forcing the party to find shelter or take a level of exhaustion. May be accompanied by mephits or storm giants.",
"A cleric leading a large group of refugees from a war/natural disaster/plague. Stopped for a few days, willing to trade for aid or information.",
"A farmer has had a falling out with a local Druid, and his crops are withering. The Druid is his wife.",
"A bard or minstrel, half dressed and looking over his shoulder, quickly coming down the path.  Looking a bit worse for wear he explains how he was run out of town for playing a song about the victory of the ruling kingdom against an uprising.  Unbeknownst to him, many of the town members sided with and fought for the uprising.",
"A farmer going to/returning from market with his meager goods.  He sells the worst looking, yet best tasting apples one could ever find.  He doesn't know why his orchards produce such odd fruit. Any player who eats an apple is healed for 1d4-1 hit points.  A player healed must also roll a 1d4. On a one they suffer one point of exhaustion.",
"A farmer returning from town with his four adopted sons.  None of the children resemble the farmer in anyway. The children resent the farmer for being forced into the farming life.  They tell lies of being kidnapped and abused in hopes a group of heroes will take them on exciting adventures.",
"A farmer returning from town with his three daughters is seen on the side of the road huddled beneath their damaged cart.  The family has been attacked by a swarm of stirges as the evidenced by the presence of a stirge, bludgeoned with a shovel. The family asks the party to escort them the remainder of the way home.  Their home is an hours walk out of the way for the party and an hour is needed to fix the cart.",
"A young girl is found sitting alone on the side of the road.  Barefoot and hungry, she wishes to stick with the party until the next town where she can find safety.  Her intentions are to wait until a second adventuring party of equal or greater skill pass by and beseech them to save her.  She will say to them that she has been kidnapped by the players and that they have stolen her gold. Unless persuaded otherwise, the adventurers believe the girl’s story.",
"A young boy is found intent on running away to the city.  He is small and would surely lose a fight to even the lowliest of goblins.  Yet he begs and pleads to become an adventurer and join the party on their quest.",
"A lost child is found in tears and holding a torn sack.  While the child is not injured the vegetables he carried are completely ruined and smashed into the dirt.  He was picked on by neighborhood children while returning home from the market with his family’s supper. His parents will surely be upset if he returns empty handed.",
"A troupe of entertainers, led by an overdressed and curious Elf.  The Elf is a ring leader in a traveling circus of sorts and is always looking for new and exciting acts for his traveling performances.  The Elf will pay top gold for any such acts or items that he can use in his shows.",
"A full company of mercenaries, led by a stout, dark bearded Captain, marches down the road.  They have been recruited by a nearby fort to rid a cave of bugbears. If the party is in need of employment they can join the fight, otherwise the captain pays for any information on the location of the bugbear’s cave.  If false information is given, members of the mercenaries find the party 10 days later demanding the return of the money including interest or blood.",
"A small group of mercenaries, dishevelled and sweating.  Their group was recruited to help defend a town from goblins.  When the reports of goblins turned out to be instead a warband of savage Orcs, these few mercenaries ran away leaving the others greatly outnumbered.  Although the mercenaries will not tell the truth of how they were cowards, a week later the party over hears rumors of the incident and the cowardice of some of the mercenaries.",
"A minor noble travelling via horse, with servants.  He is off to ask for a woman’s hand in marriage. But he is still in need of a notable gift to offer to her family.  He will attempt to buy anything that the party has visible that might fit such a need.",
"A minor noble returning from an unsuccessful hunt, with retinue.  The noble is not a skilled hunter yet thinks himself to be the greatest in the land, partially due to the plethora of compliments he receives on a daily basis from his followers.  He challenges the party to a contest of who can bring down the largest brown bear and wagers his pouch of gold.",
"Local constable and his posse, with a suspicious outlook of strangers.  He explains that there has been a series of murders in the area over the last month and demands to know the party’s business in these parts.  He encourages that the party keep their business above board.",
"A hunter with a huge longbow strapped to his back.  The hunter tells the party his name and that he is looking to hunt the most dangerous game in the lands.  The next morning the party finds an insidious note left at their camp during the night saying that the hunt is on.  Over the next few days the party finds hunting traps meant for them.",
"A pair of hunters are arguing about who is to blame for a missed shot.  They both claim to be the better marksman. They ask the party to judge their skill and each shoot at a notch on a tree fifty yards away.  After they both land the shot perfectly the party is asked to say who is better. If the party picks one over the other the party is given a gold piece by the victor.",
"Large trading caravan, with accompanying surly guards.  The caravan is smuggling drugs through the kingdom but isn’t afraid to sell some to a few wanting adventurers.  If, after discovering the content of the caravan, the party refuses to buy any of the drugs then leader becomes noticeably afraid the players will tell law officials.  The party must either buy some to put him at ease or convince him that they aren’t going to inform the law.",
"A farmer travelling towards town broke an axle on his cart loaded with crates of vegetables. A small skill challenge of 2 successes/2 failures will overcome this encounter. The farmer will thank them and give the party a skin of apple ale and 2 rations for the trouble.",
"3 strange looking farmers (thugs) on horseback ride past guiding a herd of goats. A few minutes later a roughed up farmer with a black eye, one boot, and a pitch fork run by shouting where the thieves took his livestock.",
"The party accidently camped on a nest of bright yellow, rat sized lizards. At dawn they 1d4+2 emerge from their holes. Any quick movements will set them off.",
"The party passes a purple carriage with a small goblin steering the horses. As the party gets closers the goblin retreats into the carriage and it folds out into a stage. The goblin will perform magical traveling circus act complete with freaks, tricks and goofs. While the party is mesmerized a small Crawling Claw will attempt to take items and coin from the party without their discretion. The goblin will leave in a hurry after it acquires it’s desired goods.",
"A horse lays down in the road. An elf man appearing to be in his 70s is crying next to the horse saying his horse will not get up. The horse has a broken leg and is almost 50 years old. If the horse is healed the man will give the party his lucky charm (A Rabbits Foot). When investigated it is clear the Rabbits Foot will give the equivalent to one reroll before it’s magic wears off. If the horse dies / is killed the man will sob uncontrollably and cast a curse (disadvantage on next save throw) on whoever caused it or is closest.",
"An intoxicated gnome is stumbling side to side across the road. He wishes to be left alone. He will drop his coin pouch with a “klink!” on accident. He will not notice. The party may take it to get 2 sp and 5 cp or return it for a flask full of “the blue juice”. It is a blueberry based ale that will allow waterbreathing but will also quickly intoxicate.",
"The party comes across a wedding in progress in a small woods near a village. They can pass by, or crash it.",
"While travelling on a road, they meet a family in the process of moving. The family overloaded their cart with furniture and baggage, and are having a loud fight about whose fault it is instead of fixing the broken cart.",
"A teenage sorcerer is hiding near the road, using Dancing Lights to screw with travellers. He runs away as soon as he sees how armed the party is.",
"The party meets a disgruntled cleric in the process of using Shape Stone to change a statue of a beloved religious figure into something rude.",
"The party comes across a young elf holding up traffic in a busy intersection as he's trying to save a bunch of ducklings from being trampled.",
"A recent rainstorm washed out the road and toppled a large tree across it.",
"The party finds a well-used campsite by a cliff face. The cliff has handholds and footholds carved into it, and is used by local rock climbers for practice.",
"The party runs across a clearing filled with food wrappers and empty wine bottles. Several wild animals are eating the remnants of food in the wrappers.",
"One the road to town the party meets a traveling musical instrument salesman. The salesman is highly charismatic, and willing to pay the party to safely escort the party to town. If the party has good insight they can discover that the salesman is a con man, and he will never make good on orders. The party can then either negotiate to take a cut of the profits or they can inform the town of the scam",
"The party sees a large band of goblins camping on the side of the road. They do not appear to be hostile. Upon closer inspection, the party sees they are surrounding a shallow, goblin-sized grave. A sign sticking out of the grave has \"KAPTiN\" scrawled on it.",
"The party crosses paths with another ragtag group of adventurers, looking for the same McGuffin. However, this party is heading in the exact opposite direction. (Could be good way of introducing Rivals, as seen in Xanathar's).",
"A large pillar of smoke rises from a nearby farm. The farm has just been ransacked by a party of orcish raiders.",
"A roadside farm is holding great festivities to celebrate the family matriarch's birthday. They invite the party to join. Halfway through the celebration, a representative of the King shows up to arrest the old woman on suspicion of treason.",
"The party meets an impostor claiming to be a well-known ally of theirs.",
"A nearby village is holding a music festival. Their headlining act? The famous travelling minstrel group Arcane Fire.",
"A creature of legend (Gorgon, Unicorn, etc.) has appeared in the land for the first time in centuries! Unfortunately, it happens to have appeared right in the middle of the road the party is travelling on, and refuses to get out of the way.",
"The party arrive in a village just in time to see a mob of peasants lynching a half-orc.",
"An escaped sheep begins following the party. At the next town, they encounter the shepherd, worried sick, who is now convinced the party stole the sheep.",
"In a nearby field, two incredibly bored peasants are staring at the sky, betting on what the next bird they'll see is.",
"The party stumbles upon a brilliant white stag standing perfectly still by the side of the road. When the stag notices them, he will dart off. Soon after, a nobleman and his hunting party will appear to chastise the party for scaring away the stag, which his family had been trying to catch for generations.",
"Players who succeed a passive Wisdom (Perception) check notice a portal to another plane open up, thousands of feet in the sky. A blue whale and a potted petunia fall through the portal, and just before hitting the ground, another portal opens below the whale and petunia. Soon after, both portals disappear.",
"A traveling painter will ask the party for food when they're setting up camp. The painter has pictures of a multitude of locations.",
"An odd looking cart comes traveling slowly towards the party. If questioned, the two shopkeepers will each promote their wares (Flowers and Candy). A tall, relaxed tiefling sorcerer is traveling with them as a guard.",
"Two monks with red pants hurries past the party. The monks may ask them if they've seen anyone with a glowing lily.",
"The party comes accross a large bean stalk going high up into the air. They can see the top, but it doesn't seem to be leading anywhere. 1d8 Shriekers are planted around the bottom of the bean stalk.",
"The party arrives at a rest stop by the road where a bunch of carts have stopped to for a small market. Every night a troupe of gnomes hold a play on a make shift stage while two thieves go through the crowd to pickpocket the audience (PCs' Perception vs Thieves' Slight of Hand(+9)).",
"The party finds a wagon by the road. Upon further inspection it's a shop run by the slightly stupid orc, Ted. Ted has many items, some more magical/usefull than others. Due to his curiosity for new things, small exotic items can be sold to him for a way higher price than normal.",
"The party encounters two half-orcs giggling and making bets while watching two large creatures duking it out from a far.",
"The party comes accross a large serpent made of stone that is coiled up and around the stem and branches of a tree. Large iron chains are tying it to the tree as well. Upon further inspection it seems like the tree is trying to move. If freed from the stone and chains, the moving tree will attack the party.",
"The party sees two dwarves eagerly discussing while drawing something on a large, flat rock. If inspected it looks like a capsule with a bunch of numbers. If asked about the drawing, the dwarves will explain that they're wizards trying to get to the moon.",
"The party spots a man on a horse charging towards an old windmill. The air genasi living there is not pleased.",
"In a stary night the PC on guard sees a meteor shower. One of those might hit nearby.",
"A prisoner transport is on the road. The convict in diea huge metal cage calls out to the group.\"I am innocent! I swear! Help!\"",
"While entering a village the PCs see a green clad person wandering the fields. Upon approaching they learn it is the village priest blessing the earth for the upcomming harvest.",
"On a narrow mountain pass suddenly large amount of lifestock appear. A shepherd is relocating his herd to a new area. He knows the area inside out, so he can give directions.",
"While wandering the group finds a hut for weary travelers. A small box is put up for donations. Several other \"guests\" are already preparing dinner in a primitive kitchen.",
"Upon entering a new town a massive parade is hold. It is the day of the city's patron saint. Beer is on the baron today.",
"One character from the party hears a small crunch under his foot and looks down to see he stepped on a rats tail but the rat doesn't run away it chatters at him madly and incessantly, if the players are curious the \"rat\" (actually a commoner) leads them to a nearby wizards tower the wizard is annoyed at seeing the \"rat\" again and says, \"didn't you learn your lesson?\" The Pc's can help the \"rat\" or not.",
"Some goblins are seen playing with small fireworks on the trail ahead of the party, the goblins scatter when they see the party.",
"As the party is traveling they see smoke in the distance due to a large wildfire.",
"A soldier is standing in front of a house with a letter, telling the family that they are being evicted.",
"A farmer finds a corpse in his field that has turned nearby crops black, he is afraid that he has been cursed.",
"Someone stands there screaming about being attacked, but there is nothing around, cuts keep appearing as he screams.",
"A handful of people are found hanging in the woods with brands on their bodies.",
"A ship watches another ship disappear into thin air, leaving only ripples in the water.",
"An oddly specific book about your character is found on the ground, as if someone has been following you and keeping a journal.",
"A thief is seen scaling the outside of a building at night.",
"A young boy is excitedly running about a market in a city, amazed at how much there is to offer.",
"The party approach a wagon on the side of the road, one of its wheels is busted and the horse pulling the cart is dead. If they pass a low perception they hear whimpering coming from the drivers seat. It’s a gnome merchant who was taking shelter in this small compartment for the evening after his wheel broke and his wagon was pillaged in the night.",
"The party come across the remains of a fairly recent battle, there’s lots of corpses. A hooded figure walks amongst the bodies. A soldier clinging to his last moments sees the figure approach him and begins to plead. The figure bends down and reaches towards the man, he draws his hand back and in there is something glowing, the man no longer makes a sound. If a PC makes a movement the figure gets startled and dissipates into a murder of crows and flies away, dropping the glowing object.",
"An orc on horseback, attempts to poke one of the characters while riding past. He was dared to do it by another orc.",
"A hill giant mugs the party in an open field.",
"An ogre is bathing it's filthy body in a nearby village's water supply.",
"The party meets a kind traveler who's really a feylock who's patron is the tooth fairy. He offers them beverages that are drugged and once they are fully anesthetized, he extracts a tooth from each of them. The party doesn't find out what happened for a few more weeks.",
"Adventurers run into a lost red haired man with torn clothes and busted manacles. Claims he was kidnapped by bandits but escaped. He asks the party to escort him to his grandmother's house, which he suspects is nearby. If the players agree to help him, but can't find the house in the next several days, he involuntarily transforms into werewolf and attacks. If they do find the house, grandma is inside and is a fully-transformed werewolf.",
"A young half orc fighter/barbarian who has just recently fought off a couple of guards by himself, looking for a fight he challenges the party to 1v1 duels. He'll probably die but the idea was for him to magically come back, they'd fight him again, he dies etc. Every time he'd have better gear and level with the party. 3rd time he'd be passing by the party, not looking for a fight but will accept the challenge if given. 4th and last time he should be super powerful, possibly 75/25 in favor of the orc, after the fight he should help the defeated party member, thank them for helping him grow as a person and share a drink with them. By the 3rd/4th time he should have lost his orcish bloodlust and should be a reasonable person, just someone who is still very good at fighting.",
"A wizard passing by looking for his master who left whatever wizard school. He should be friendly with the party and should offer to help the party wizard copy a spell from him spellbook free of charge. Party should meet up with him later and he'll give another spell etc. Eventually they'll come across him nearly finding his master and they can help him. I always figured he's be a necromancy student and his master is trying to become a lich, kind of a nice twist.",
"The party should pass by an extremely sterotypical adventuring group that are about to be killed by whatever foe they have annoyed. After they have been saved the NPC group will take the glory for themselves and say how they saved these passers by (the PCs), they can then be overheard in the nearby inn. Eventually they will come across one of the members sitting alone in a dungeon, where they have been defeated, badly, very badly. The remaining NPC will be shellshocked then its up to the party if they want to go in a clean up after them one final time.",
"A trail of small trinkets and/or gold lead the party into a hole in the ground.",
"A young NPC and their even younger sibling are attempting to build a house/shelter for themselves — they are doing a poor job.",
"A cat is trapped on a log floating down a rushing river. Upon further inspection players discover that the log is an awakened tree.",
"A magically concealed spa resort for the extremely wealthy.",
"A large rock slide has blocked the road ahead. A camp of religious fanatics have claimed the rockslide as a monument to their god and forbid anyone from interfering with it.",
"A turtle riding on an animated chair.",
"Two travelers are walking in the opposite direction of the party. One of the travelers is deaf. The other is blind. They are best friends.",
"A traveling bard offers to sing a song about a local legend/riddle that may or may not lead to a treasure/adventure if solved",
"Party comes across a house. A man outside is building another house and muttering to himself. He's a discontented commoner who is convinced he can build a better village/kingdom than the one he came from.",
"Party encounters a person/group claiming to be one or more of the party members. Claims credit for adventures the party may be known for. Flees when confronted.",
"A headless body is looking for its head. The head is nearby calling out and berating the body for continually missing. Maybe the body kicks the head by mistake. If head and body are united, the body still acts independently of the head. If the party helps, the head is ungrateful and says he didn't need help, while the body shakes their hands and conveys thanks and elation.",
"The party is forced off the road by a quickly traveling group of high ranking diplomats. These folks are racing to another city to deliver urgent news (a regent's death? A plea for help? About to miss a trade deadline?). They're accompanied by half a dozen mounted guards that ride ahead to clear the way. In essence, a test of whether the party is willing to vacate the road when asked. If they decide to confront the guard and refuse to leave the road when asked by representatives of the local power, they're chastised or even imprisoned in town. They could instead ask to assist if they're well known in the region, or ask in town as an opening to a plot hook.",
"A squad of soldiers/guards is moving down the road in the opposite direction of the party. They demand the party leave the road and let the guard party pass. After passing, the PCs see the guards are escorting a prisoner (or prisoners) in a cart. The prisoner cries out for help when they see the PCs, but is somewhat brutally quieted by a battlemage's Shocking Grasp. Does the party interfere? Is the imprisonment just? Can the prisoner plead their case?",
"A guard patrol stops the PCs and searches their belongings, claiming a wanted Necromancer has transformed into a rat and is skulking around the region. Do the PCs submit to local authority?",
" A traveler heading the opposite direction warns the travelers of dangers up ahead. They must pay him 10gp to learn any details and how to avoid it (the dangerous could be real or made up)",
"A friendly stray dog approaches the party. They are miles from the nearest town and if they pay any attention to the dog it will follow them.",
"The path is entirely blocked by a large tree that appears to have grown on top of the road. The tracks in the road look like the tree only recently got there. (could be an awakened tree or just a druid playing pranks)",
"Three halflings chasing a wild boar burst across the road. The boar has been eating their prized herbs.",
"A travelling bard offers to perform for the party for a small tip. He's actually pretty terrible.",
"A sorcerer sits inside a stone cage near the side of the road. He was imprisoned there by a surge of wild magic.",
"A foreigner in strange clothing asks the party for directions, but he only speaks draconic.",
"A miniature chest from leomunds secret chest sits in the middle of the road. If the party summons it's larger duplicate they find a gnome wizard stuffed inside the chest.",
"Three barrels of ale sit abandoned on the side of the pathway in a small cart. They are lightly hidden and bear no markings to identify their brand.",
"At the next river crossing, the party finds a small funeral procession scattering the ashes of their deceased friend in his favorite stream.",
"The party encounter an older woman sitting by the track, watching the clouds pass by. If approached, she will politely ask them to leave her be, as she is deep in thought. If pressed, she will tell them she is a famous writer trying to think up a plot for a new book and, upon learning the party have slain great monsters, will press them for details and write a wildly popular book about them.",
"A group of villagers stand around a large, rotten tree by an ominous tomb. The area around the tomb smells of death and the grass is a withering grey. The villagers are trying to cut this tree down before it falls on the tomb. They are unsure what the tomb contains but are fairly confident it should continue containing it. If left to their own devices, they will topple the tree directly onto the tomb, releasing a lich. This lich will demand who was responsible for destroying its tomb, at which point the villagers will blame the party. The lich will then thank the party for their service, kill the group of villagers, and leave. In the future, this lich will always greet the party as dear friends, ever welcome to its growing palace of death.",
"A man comes along the path toward the party, riding a donkey. This man then slowly leans to the slide and slips off his donkey with a poof. The party may then approach and see that the man was a straw dummy. The donkey will then look them square in the eye and mumble, \"Uh... Would you mind...?\" After loading the dummy back on the donkey, it will quietly continue on its way.",
"A book lays open by the side of the road. It's trite.",
"In the middle of the forest, the party walks straight into an invisible, wooden wall. They will then be greeted by a nervous but friendly voice from nowhere. This invisible hermit will invite the party into their invisible home and offer them invisible scones with invisible tea and invisible cream made with invisible milk from his invisible cow, Mandy. This man is blind and completely unaware that he and his home are invisible. In fact, he refuses to believe it when told so, taking it as an obstinate and frankly insensitive joke.",
"The party comes across an area that was recently used as a battlefield. There are some healers/clerics tending to the wounded. One of the soldiers (a local, defending his homeland) gets angry with a nurse for tending to the wounds of an enemy soldier (a foreign invader). The nurse says she and her fellow healers are not there to take sides, only to take care of the wounded. The angry soldier and a few of his comrades threaten her and the enemy soldier she was tending to. The party can intervene (or not) as they wish. If they stand up for the nurse, unless they can somehow deescalate the situation through persuasion or intimidation, the local soldiers attack them. This will give the party a bad reputation among the locals, but the nurse will speak well of you to the rest of her colleagues, and the foreign soldier will thank you for saving his life, and tell his family about you. If the party ever visits his homeland, there's a chance they will run into his family who will be grateful.",
"Near a border, the party comes across a merchant wagon pulled over on the road, being accosted by the lawkeepers of the land. They're being accused of smuggling illegal goods into the country. Voices are raised, and it looks like the situation is about to come to blows.",
"The party encounters a gaggle of Kobolds in the mouth of a cave, starting their new burrow. It looks like they're barely an hour along with the task, with some digging and some constructing traps to set. The spokesperson fearfully offers them some money to leave them alone, or at least come back later.",
"Moving through the trees, they spot an Orc hunting party. The orcs seem to be tracking a herd of animals for their nearby encampment, and are arguing amongst themselves as to which way the tracks lead.",
"An intermittent line of people come and go from the local lake, carrying wooden buckets of water back to town. If asked, they say legend has it that their well in town was cursed a few generations ago, and this is just a daily thing for them.",
"A potion vendor in town has his stand crashed into by a wayward horse. Glass shatters, and a sparking, multicolored smoke begins to rise from the floor as the vendor flees, yelling for everyone to leave the area immediately.",
"Two Goliath men take turns trying to lift a massive boulder. They've clearly been at it a while. They do nothing but grunt when the party asks why they're doing this.",
"The party encounters a circuit Judge/Executioner traveling from town to town.",
"The party meets a man searching for his fathers lost donkey.",
"A tribe of centaurs crosses the road heading into the forest. Hostile movements warn off any approach.",
"A bounty hunter leads her horse, over whose back is slung a limp form.",
"A hill giant or troll stands at a crossroads cradling a wounded gull and asking the party which way to the sea.",
"A small graveyard of perhaps two dozen grave markers outside a small town. Every grave bears the same name.",
"On a busy street, a dog runs past the party carrying something in its mouth. The dog's apparent owner shoves past the party moments later, yelling for the hound to \"drop it\".",
"A cat knocks a potted plant off of a window sill. The pot shatters in front of the party, spraying dirt everywhere. Someone from inside the house shouts and the cat leaps away.",
"A man equipped with low-quality gear appears, demanding that one of the party members duel him. It's clear the man has no skill with a sword, and he is easily beaten.",
"As you enter the tavern, you see a large goliath man arm-wrestling a large raven haired Aasimar female. You hear the cries of a two gnomes barking out to the crowd \"10gp to challenge the goilath...100gp if you win.\"",
"You see a blue tiefling being chased by a blonde-haired gnome in plate armor. You swear you hear something about defacing a holy statue with paint. A second tiefling appears, alongside a half-orc, and they start running towards your direction.",
"As you enter a bookstore, you see a posh elderly human male wearing unique glasses is arguing feverishly with another human male, who is wearing much humbler garb. They are arguing over which one of them is to purchase a certain arcane tomb...and things are getting heated.",
"Once you get into the shading forest area, you hear the sounds of combat. You look over to see a Bear, wearing armor, seemingly attacking a unarmed human female in blue robes. Oddly enough, the woman doesn't seem scared by this situation.",
"During the festival, a few characters catch your eye. A small little girl wearing a hood, possibly a halfling, is going from person to person taking small things seemingly without them noticing. However, you do notice a half-elf female in beautiful white armor is sneaking up behind the little girl with a bit of pace. Holding a very ominous looking dagger.",
"As you walk up to the bar, you see an empty seat between a lavender tiefling with red eyes and a red haired half-elf sporting antlers. They are in the midst of a drunken conversation about life. The tiefling speaks about living in the moment...the half-elf speaks about responsibility and destiny. As you sit down, they ask you what do you think your purpose is in life.",
"Upon entering the temple, you see a Kenku girl holding a dagger sitting on a bench. She is looking at a large raven, the raven attempts to bite her. The Kenku girl responds with \"Go Fuck Yourself\"",
"A copper dragon either young or wyrmling plays pranks on the players navigate a series of canyons. The players can only escape the cavern if they each tell the dragon a good joke or riddle.",
"An arrow whizzes by the party and hits a tree behind them. It's actually a random hunter who thought a party member was an animal (perhaps a bear if a party member is a barbarian), and is incredibly apologetic. He knows his small section of these woods well, and offers to show the party around.",
"The party see what appears to be a skeleton with a polearm in the distance, threatening a farmer. Looking closer, it is actually a farm tool and the skeleton is working the land alongside the farmer.",
"There is a small shack just off the road that appears to be long abandoned. If the party investigates strange noises coming from it, they will open the door to see a family of foxes has made a nest. They scatter out of a small hole in another wall. The shack has nothing noteworthy, only typical poor, deteriorated furnishings of a long-dead hermit.",
"The party hears deep and somber sobs. They find a hill giant weeping over a goat whose legs are broken. “I stepped on my friend! I’m so sorry, I’m so sorry!” If the party can heal the goat, the giant becomes a guide for the area.",
"The party finds strange markings on the walls of a cave. Ancient paintings of kings, queens, and people from hundreds of years ago, but local kids have drawn huge penises on all of the people.",
"The party finds a small, abandoned farm in the woods. The soil is dry, and the pen’s gate is open. In the back of the house, four stones are erected, signifying the graves of the farmer’s family.",
"A party member (after failing a check/save) gets caught in a hunter’s trap. The hunter is rightly annoyed at them having wasted/damaged their trap.",
"The party finds a polite skull that asks them kindly to help him find his body which is running around on its own, scaring the local townspeople half to death.",
"Two guards search a manacled thief against the wall, pulling out an intricate jewelry box from his satchel. A noblewoman beside them thanks them profusely and gives them a gold each for apprehending the man that robbed her.",
"Two young mages, each holding wands, stand back to back in a field the party passes through. Another mage reads out the rules of the fight as they prepare to duel.",
"Blinking lights, slightly larger than those of a firefly, float lazily through the party’s camp at night before disappearing into the trees.",
"A shaking in the bush reveals two rabbits, who begin chasing each other by the road.",
"A gaunt beggar lies in an alleyway, clearly having not eaten in a couple days. Should the party help him, he will offer up a small straw doll, a memory from his childhood.",
"As the party enters town, they see farmers tending to their crops.",
"A stray cat catches a bird, and drags it into an alleyway to eat its dinner.",
"A messenger rushes by the party in his chariot on the road, causing their carriage to be stuck in the ditch. As this happens, he yells out in an ancient tongue “Raeda in fossam est!”",
"A tree falls about 15 yards off the trail. The party sees a lumberjack preparing to bring the harvested wood back to town to sell.",
"A drunken couple stumble out of the tavern, holding onto each other for balance, as they make their way to their home.",
"The party comes to a long-abandoned and forgotten cabin in the woods. Some undead animals shamble around, trying unsuccessfully to get inside.",
"The party find a lone cottage, recently in use. It's the home of a hedgewitch or sorceress of some kind, and she isn't home.",
"The party meets a wandering collector on the road, and he's just all sorts of keen to give away a few things - but particularly a rather normal-looking pocket watch.",
"The party comes across a woman foraging for herbs. She claims she needs them to cure a sick loved one, but the herbs she's gathering are all super poisonous.",
"One or more members of the party have taken a private room at an inn. They find a locked diary tucked underneath the mattress, looking like it's been there for years.",
"The party finds a missing person at a very popular inn. Or at least parts of a missing person. In the kitchen.",
"The party passes a farm and find the family rushing to pack their things and leave. The field looks fine, and there's no news of a threat - even neighboring farmers seem confused.",
"The party finds a free-standing stone arch constructed in a field. If they pass through, they soon discover they have literally walked into tomorrow: Exactly 24 hours into the future.",
"Alright, there's still some debate here, but most of the people in this remote hamlet are sure a local stray cat is actively cursing people.",
"It is so hot, and a hermit druid stubbornly refuses to let anyway swim in the nearby lake. He hasn't given a proper explanation as to why.",
"Whiles traveling along the road they encounter a armed procession escorting a covered wagon, the party is firmly asked to step aside and let them pass (if the road is narrow).",
"Your party spots a griffin in the air, survival / nature roll to identify the creature, it suddenly dives only to ascend soon after carrying something in its talons.",
"A stray dog approaches the party, holding up its front paw and whimpers as if hurt, begging for food.",
"A recruiter is trying everything he can to convince the party that joining the army is the best thing they can do, they are obviously officer material!",
"The barmaid accidently spills a drink on a party member, she apologises profusely and the victim is comped a drink and a meal.",
"The party finds an old cave inhabited by a really ancient green dragon who just wants to talk to someone one last time before passing, all its treasure was in the huge clan of lizardmen that roamed the area centuries ago. (It is not uncommon for green dragons to not hoard treasures but instead focusing on ruling lesser species).",
"A party member got arrested for drunken disorderly, in my campaign it happened to him more than once. He is let out again come morning and sobriety.",
"Two carts has collided, blocking the road, the merchants are arguing about whos to blame, a small sack of coins can be earned for helping the merchants out.",
"In a small village by a lake the party hears about the enormous trout living in the lake, said to be two spans long and ince ate a cat.",
"Ooze Farmers - 2d6 + 6 Halfling commoner Ooze farmers with oozes in glass jars in their carts or barges (depending on if you encounter them on the water or land). They wear thick leather gloves, aprons, goggles, and other protective gear. They will sell grey oozes in a jar for 25gp. The ooze is used to make a powerful hallucinogenic drug. The drug has a 5% chance to turn you into a thrall of Juiblex.",
"Richart the Ranger - A 4th level wild elf ranger keeps tabs on the movement of a dangerous Black Dragon, and warns party members and folks in the town about when they might be threatening civilization. He can lead the party to the dragons lair.",
"Bobog the Stone Giant & Roscommon Tanglefoot (Halfling Scout) A halfling in leather armor rides on the shoulder of a tall, lanky stone giant. They tromp through the swamp, singing folk songs loudly. Bobog and Roscommon are traders and thieves. They will try to trade with the PC’s, travel with them, and try to rob them in the night.",
"Freesla the Enchantress - Freesla lives in a small settlement of a few human families in the swamp. You find her wandering through the swamp, gathering spell components. If you follow Freesla back to her settlement, all the settlers speak very highly of her, and she seems to be a matriarch of the settlement. She orders the members of the other families around, she scolds them, and even may hurt or kill someone when made angry in front of the PC’s. In reality she is dominating the these families with enchantment magic. She wields a wand of smiles that she uses during encounters to force family members to hide their despair.",
"Lost Child - The party hears the cries of a child in the woods. Mipha is inconsolable without a DC 12 Persuasion check. Players gain advantage on this check if they make some attempt at role playing. Mipha is a 5 year old girl who belongs to a young couple who live in a nearby village. Her parents, Carlot and Finn, make a living selling herbs and potions. When they return the child, the young couple is ecstatic with joy. They believe it is a miracle that their daughter was returned to them, as she has been missing for nearly 9 months, and they have given up on ever finding her. Mipha has no recollection of any of the past 6 months. Carlot gives the party 1d4+2 healing potions (everything they have on hand) as recompense for returning their daughter.",
"Wrestle a Bear - A stout dwarf (Fango) has a bear on a chain. He is surrounded by a roaring crowd. People are betting on who can wrestle to the bear.",
"A Shepard is chasing after a stray sheep who's running frenzily towards the party",
"A farmer with a cart filled with avocados is sitting by the side of the road with a desperate look on his face. If the party asks, it seems one of his wooden wheels has broken and he can't get back home from the field. If the party helps, he gives then some avocados in return - which of course, will all ripen EXACTLY at the same time and then rot if they don't eat them right away.",
"The party comes across 2 bards arguing whether the ground is flat or round, with the flat supporter clearly being on top. An alternative arguement is whether dogs can look up or not.",
"A trio of scholars are ahead on your path, entranced by a carved stonework face jutting out the of a small hill nearby. Even from this distance their voices seem heightened - and from what you make out - by an argument. It's style of architecture is historically not from this region, and seems less crumbled and decayed than it should be.",
"After staying the night at a flotilla village, you each wake and begin to prepare your adventuring day. But, once you finish belting and donning your usual gear, you feel a moist, cool region on your calf. Someone has placed a brightly colored fish in your pocket during the night. (insert cultural or local reason for this)",
"While traveling down a busy main street, a shopkeep pleads to a landlord to extend his deadline for his rent.",
"A desperate family runs into an apothecary carrying a limp child. \"Tough luck those lot have, that's their third kid this week. Keep tellin' him to not let them see those Cendric boys,\" mutters a passerby.",
"A browned, curled sign is abandoned next to an empty crate. It reads: \"free blinded kittens, not all experiments can go well.\"",
"The party encounters a pleasant looking inn on the side of the road. Upon entering, they see that there are no customers, but there are people staffing the place. The bartender excitedly welcomes them and offers them a drink and some food. Upon drinking from the mug offered to them, a party member will have their face bit by the mug - which is actually a mimic! In fact, a lot of the furniture pieces are mimics as well, and the staff are doppelgangers who have been preying on lone travelers and small groups.",
"An animal sprints across the road, then another and another, a larger predator then also sprints across the road in a panic. The party will then start to smell the smoke of the forest fire heading their way! Perhaps it's time to run?",
"The party accidentally startles a flock of birds, which proceed to take off and drop bird poop on the party. It is a LOT of poop. Party has poison condition until the poop is cleaned off.",
"The party is somewhat startled when a wild looking old man runs up to them and exclaims: \"I've done it , I've done it; I have perfected my soup recipe!\" He then invites the party to try his soup back in the cave he calls home. The soup is delicious!",
"The party hears and then sees a female half-orc walking down the road reciting some truly awful poetry; at least she is enjoying it.",
"The party encounters a recently fallen tree. Right next to the fallen tree is a crudely made (possibly magic, or maybe using some other driving force like hydropower) seismograph, and it has no record of any disturbance. There is no other evidence of anybody having been near the tree.",
"The party encounters a thunderstorm. Unless the party takes shelter in a safe place, a bolt of lightning from the Call Lightning spell strikes them, centered on the tallest creature in the party.",
"The party encounters another adventuring party, who offers to escort the PCs to the nearest town at a reasonable price. They might lie about nearby dangers, greatly exaggerating them, or they might simply be wanting to help out for a price.",
"The party encounters one human ranger arguing with a wood elf. A dead deer lies between them with two different killshots on them. Both claim the deer as their own. To settle this, they decide to hold an impromptu archery contest and the party will be the ones chosen to be the judges. Two notches are drawn on two trees fifty feet away. When they fire, both arrows hit dead center. If one is picked over the other, a fitting gift will be given. If a tie is declared, they grudgingly agree to split the deer but the only thing the party will get is a token gold piece.",
"An assassin that's been hired to delay the party from arriving will sabotage them in a way that's more inconvenient than deadly. There are a multitude of things the assassin could do, from breaking the axle of their cart, killing their mounts, stealing their rations, etc. But the assassin won't dare attack. It hasn't been paid enough for that.",
"The party comes across a hunter wandering out of the wilderness with a backpack full of raw meat. He's very genial and even offers to share some information about the local area. If it's nighttime, he asks if he can camp with the party, citing safety in numbers. Eventually, he leaves. Later on, a patrolling band of guardsmen stop the party, citing that a serial killer with cannibalistic tendencies was spotted near the area.",
"An ambush has been set for the party. Several highly-trained mercenaries are in the best possible positions for an attack and they will attack the party in a highly methodical manner. However, a round or two into the fight, one of the mercenaries realizes that these aren't the people they were meant to ambush and calls for everyone to stop.",
"A trail of dead kobolds and dragon cultists leads to a small cave where a cambion descended from Graz'zt stands overmounds of gold while admiring his reflection in a silver-plated mirror. The kobolds and cultists are remnants of a dragon cult and they foolishly mistook him for one of dragon-descent and stole a hoard for him. He slew them when they found out he was lying and now he's wondering how to get this all to the Abyss. He ignores the party as long as they don't try stealing the hoard.",
"A tribe of around a hundred kobolds is migrating from one area to the next after having been driven out their former land. They try to avoid fights, but are more aggressive during night. They are lead by a Kobold Scale Sorcerer guarded by two Dragonshields. They can be reasoned with, as they are merely looking to pass by.",
"A small company of hobgoblins march on the open road. They are composed of a dozen regular hobgoblins and they are lead by their captain. The group is looking for employment as mercenaries and are currently rooting out some bandits in the area to prove themselves to the nearby town that they're sincere. Two hobgoblin Iron Shadows sneak ahead and around the company to scout for potential bandits.",
"A dishevelled looking noble and his retinue of servants are resting in the shade of a tree. The noble himself looks depressed. He is on some sort of suicidal quest that the father of his love ordered him to go and he has no clue how to go about doing it. If left alone, the party eventually finds him bleeding to death in the area he should've gone.",
"A vengeful paladin of renown rampages in a half-orc, orc, or tiefling settlement. One of his loved ones was killed in a nearby village and all the evidence blames a half-orc berseker/orc raider/ tiefling sorcerer. He's half-mad with rage and is only willing to negotiate with openly religious party members of good deities or good friends of his. If the party isn't there to intercede, the whole village will be wiped out.",
"The party passes by a group of merchants selling their wares. One of them is very aggressively attempting to sell his cabbages for a copper piece each. Every one of the other merchants had already bought at least a dozen. The man is a mad druid with an obsession for selling his own creations. And he will just. Not. Give. Up.",
"A large stone table blocks the middle of the road. It looks completely out of place. Alternatively, it appears blocking the party's way out in a building. If the party touches it, it feels like a normal stone table. If the party attacks it, the stone table recoils and starts slowly crawling away. It's a mimic, cursed by a wizard to never be able to eat humanoids and it's slowly starving to death as it grew bigger.",
"A hunched over and hooded figure is surrounded by several obviously evil looking cultists who scream obscenities at him. The figure looks like he's praying. When the cultists attack, he reveals himself to everyone as an Aasimar. If left alone, he easily dispatches the cultists before telling the party that he is merely there to pass on a message from his Lord. Unbeknownst to the party, he serves Asmodeus and will reveal that if they ask. If they attack him, he simply retreats. The message is one that's beneficial to the party, but also implies a course of action that is beneficial to Asmodeus as well.",
"The party comes across a tiny merchant wagon being attacked by a crazed, naked one-armed dwarf wielding a tree branch. The merchants are halflings and they're defending themselves as best they can with forks and a solid iron pot.",
"The party encounters two nobles, twin sisters, who hail them. One of them wishes to be an adventurer, even if she isn't very skilled, and the other accompanies her to make sure she doesn't hurt herself. The latter wants her to go back home and is rather skeptical of her sister's reasoning. The former is just a happy-go-lucky spirit who wants to explore places. Both want to join up the party for completely differing reasons and to sway the other sister's stance.",
"As the party is walking through a grassy field, they see a shepherd wearing garments resembling those of a nearby nomadic tribe, followed by a herd of sheep (1d10 times the current number of party members), and an old-looking sheepdog. He informs them that the area is laden with predators, and he would be glad if they helped him cross. Each party member must make an animal handling check to help their group of sheep across. If half or more pass, the party crosses without issue, but if more than half fail, the sheep scatter, and while the party is retrieving them a giant weasel emerges from the grass and tries to attack those separate from the herd. At the end, the shepherd pays the party one silver piece for each living sheep.",
"The party comes across a small, slow-flowing river, filled with algae and weedy grasses. An old, worn fishing pole is propped up on one of the rocks, with it's line floating listlessly in the water. It clearly was left here by some fisherman years ago, but seconds after the pole is grabbed, something bites the line.",
"An old, gnarled, oak stump sits just off the path the party travels along. Looking through a hole in the stump's side, the shine of a golden ring can just be made out, but the hole is too small to pull the ring out of by hand, the trunk is too thick to (easily) be destroyed, and the wood is too wet and mossy to be (easily) burnt. Be it by wit, or simply by high rolls, the party will have to find another way.",
"At sunset, just before stopping for camp, the party comes upon a large group of rowdy merrymakers from the nearest town. They are preparing for a party in the woods, and allow the party to join if they wish. If they join, they can gamble with the others, drink from the groups supply of local wine and eat around a bonfire, and, later on, if the group has a bard, one of the party-goers will procure a lute and challenge them to a Bard-Off. Regardless of what occurs, the group will wake up the next day with 1-6 levels of exhaustion based on the individual player's level of shenanigans at the party and how mean the DM is.",
"A blindfolded paladin of Tyr passes the party, telling them he wishes to travel the world, but blind, like Tyr himself. The city he is traveling to next is the same one the players are currently walking to, but he is traveling the opposite direction of the party.",
"A panicked elf in torn hunting garb sprints out of the brush and past the party, clutching a football sized brown egg, his clothing covered in white feathers. Seconds later, the party begins to hear stomping and a wild, almost primal honk, before it emerges- The Dire Goose.",
"The party comes upon a large barrel. When inspected, it appears to have teeth, and eyes are just barely visible between the planks of wood. Nothing happens to those who pass it, but those who open it regardless find that it is a normal barrel filled with treasure, simply painted by to resemble a mimic.",
"The party comes upon a large barrel. When inspected, it appears to have teeth, and eyes are just barely visible between the planks of wood. Nothing happens to those who pass it, but those who open it regardless find that it is actually a mimic, and it attacks the party. Especially entertaining when used immediately before/after Event 7.",
"As the party walks through the woods, they notice the trees are filled with brown, cicada like insects. They are silent, and unmoving, but as soon as night falls they begin to chirp loudly. Sleep will be challenging unless they are dealt with.",
"The party comes across an abandoned apple orchard. The farmhouse of it's previous owner and the fence surrounded the area have long since rotted and has been taken over by plant growth, but the trees themselves are not only still alive, but are well kept- no weeds grow around them, and they still grow in neat, tidy rows. The apples are sweet and delicious, but after staying and eating the apples for too long a family of centaur returns to harvest the crops.",
"a single horse and rider come racing by the party, the horse is struggling to maintain a gallop and the rider appears to be bleeding profusely from a wound to the side. The wound is cursed and prevents healing, the rider will die in 2d6x10 minutes. The rider is a scout/spy that was caught in their escape and is desperately trying to deliver their information to their boss.",
"A family who is traveling to a new town to live with relatives is being attacked by winged kobolds who are attempting to steal the children. One parent is already injured and the other is attempting to fight off the kobolds with a crude/rusty spear.",
"An older human wizard who travels between towns and uses his small feats of magic to cure injuries/disease and entertain the townsfolk. He makes small amulets that are enchanted with a minor healing effect that recharges on the full moon. His traveling companions are a kenku (arcane trickster) and a domesticated Kobold (wizard). The wizard himself is an old Archmage currently believed to be dead.",
"A trio of wyverns dive towards the party. They will each attempt to grab an animal without a rider, or the smallest character in sight if no animals are easy targets. The wyverns will not attack, just attempt to grab someone and fly away.",
"An elven child crosses the path a fair distance ahead of the party. If the party catches up to them, the child tells the party that they are looking for their parents but they don’t need any help and then walks away. If the party follow after the child, a thick fog appears after 2d10 minutes and the child excitedly calls to his parents before vanishing into the fog.",
"You come across a pack of religious pilgrims, searching for the sacred river, which is invisible to nonbeliever's eyes. They look dehydrated, but refuse any water except that from holy river.",
"Walking through the forest, you come across standing stones, set in a circular arrangement. Old, worn, and moss covered, the glow faintly with mystic energy. A phantasmic elf women seems to float around and through them, and offers wisdom and power...for a price.",
"You stumble into a dry riverbed. A tiefling woman, her entire body,skin eyes hair and all a dark ashen color, is searching through the river stones and carefully examining small round ones. If asked, she says she's looking for her soul, which she dropped.",
"3 fantastical beings, with humanoid bodies which slowly morph into miniature cities where their heads should be, sit at a 3 fork cross roads, bickering about which path to take. When they notice the party, they each draw swords from their intricately wrapped robes and demand the party choose a way, but only after hearing their obtuse, illogical, and weird reasoning for their own preferred path.",
"You stumble across a bugbear cursing out an animated office desk, which seems to be throwing a fit and spitting out papers and forms everywhere. The bugbear, beneath his dirty rags and armor, is wearing a tie.",
"The party reaches a small pond, deep and clear, which glows with the soft blue light of magic. At the bottom are various skulls of animals and beings, though none look like the victims of violence.",
"You see several men digging up a grave under an old twisted oak tree. If asked, they say they are recruiting extra hands for a sailing voyage. None of them look at all like sailors",
"Snakes. Just snakes.",
"A small imp is dragging a tome book almost as big as it is down the road. The tome is secured with a solid looking lock. The imp says his master dropped it and he is recovering it for him, but the imp looked more like it was running away from something.",
"A young gnome, wearing only his breech cloth and nothing else, flags you down from a small rugged road intersecting your path. He asks for help, and says his friend's cart is stuck in a mud puddle. Sure enough, if you look down the road you see a cart sunk in mud. But there are clear ways around the mud on either side of it. Another gnome man is talking in whispers to a gnome woman, who seems very distraught.",
"traveling through plains, wind whips around the party in a sudden storm, quickly growing stronger. Rain begins to pelt and lighting run wild across the sky. A storm giant is creating this weather on the top of a nearby hill.",
"The party comes across a splintered log in it they find what appears to be a tiny home that has been sundered into two as the log was split",
"In a clearing in a forest a small well, long mossed over and worn. is found. at the bottom of which there are chains and the skeletal remains of a long dead adventurer leaving behind a dagger and a tiny golden chalice.",
"The party a massive tusk that has moss and other animals living on it and engraved on the center by druids is an ancient version of a teleportation circle that can be used if studied.",
"The party comes across a high elf that is utterly convinced beyond all measures that he is a ghost.",
"The party finds a disheveled path in the woods that lead to a small portly hut, smoke billowing merrily out its chimney. Inside there lives Mogdathine, the kind-hearted night hag. She treats the charters to a meal and a rest if they are kind to her. Mogdathine only attacks if directly in danger, or if it is unavoidable, and otherwise acts very motherly towards them.",
"A flock of ravens watch closely over the party, any character who spends time keeping watch over the ravens notices that among the otherwise normal sized ravens there is one that is at least four times the size of the others and watches the party with a humanoid intelligence. If threatened or attacked the ravens will ether fly away or disappear into a poof of feathers. When asked directions to a certain place the large raven caws in a slightly inhuman throaty voice the direction on how to get there and then flies away.",
"An alchemy store in a cellar begins to teleport randomly throughout a city, causing bottles within the store to begin to rattle about, spilling their contents throughout the store.",
"A baker’s shop that sells the “best funnel cakes around”, but the funnel cakes are simply stale bread magically enhanced to taste and look like really good funnel cakes.",
"A great blacksmith needs the party to pump air into his great furnace. The pump is huge and the players will need to rotate turns on it or all pump it at once.",
"An outfit of bandits seem to have set up a large roadblock up, but once further investigated, only the gruesome remains and a single note are left in the bandits place.",
"In the night sky above your camp, a Wyvern cries powerfully. A moment passed, and another, smaller Wyvern joins it. Together they twine about one another, nipping and spinning before the moon, before flying away together. Best in Spring/mating season.",
"In the road ahead, a wagon sits with a broken wheel. A merchant examines it, while his wife soothes sweating horses.",
"Sometime in the night, a rustle sounds. A quick look reveals numerous sets of glowing yellow eyes in the darkness. They stare for a long moment at the remnant of your modest fire, before fading into the darkness.",
"Looking starboard, you notice a long, sleek neck break the waves. Large golden eyes peer about, blinking in the salt tinged foam, before the sinuous neck slips once more beneath the waves.",
"A group of Kobolds in a funeral procession. If you follow, the group wanders into a local tavern and fries the body up. If you approach politely you are offered a drumstick.",
"A group of adventurers clearly bickering over an old map. If you approach they go quiet.",
"A group of adventurers, worn and tired, carrying massive sacks of treasure. One of them collapses and asks you for aid.",
"A group of pilgrims carrying all their possessions led by a priest (not Cleric) who is leading them to the promised land. He's really a shill, leading them into an ambush.",
"Several dead humanoid bodies lie in the middle of the road, their bodies peppered with arrows.",
"A genuinely massive housefly is mysteriously attracted to a random PC.",
"What appears to be a soldier in full plate armor won't let anyone further down the road. It's really an animated suit of armor the local militia had made to keep people from bothering them while they do necessary repairs to a bridge.",
"A large butterfly with beautiful wings lands on a PC. A large crow suddenly swoops in and grabs the butterfly. It perches on a nearby branch, staring at the PC intently.",
"A rather ugly troll armed with a club is tramping around a beautiful peach tree. It is the end result of a drunken bet by three wizards to see who could create the perfect guardian for that tree. It cannot leave the immediate area, and has a particular hatred for wizards.",
"The aforementioned wizards are a few miles ahead. They are nursing massive hangovers, and one of them has an extra finger. They dont know how or why.",
"An angry half orc barbarian woman approaches the partie's bard or rogue. She is pregnant. It is his. She is at least three levels above the groups challenge rating.",
"A sad looking leprechaun approaches the party. He needs help getting his gold back. In exchange he will teleport the entire party wherever they want on the continent, one way only.",
"A silver dragon flies overhead. Two hours later it flies back, looking severely wounded. It lands in a nearby field. A moment later, a group of githyanki raiders is seen following in an airship of unknown design.",
"A large blue phone booth materializes in front of the group. Doctor Who steps out, looks around, sees you, waves politely, and vanishes again. The wizard faints.",
"A group of Dwarven soldiers, looking rather badly beaten, is trudging down the road, singing a dirge. They are the last remnants of a Dwarven stronghold that was taken by a red dragon the day before.",
"An abandoned caravan is on the side of the road. It looks like one of the wagons was violently shredded apart. Upon closer inspection, you find an iron cage big enough for a Huge creature. The cage was clearly broken open from the inside.",
"A random set of keys in the middle of the road.",
"A tree stump that glows under a new moon.",
"A burned section of forest where a wildfire blazed. The ghosts of several merchants haunt the remains of their caravan. The ghosts bicker among themselves about who started the fire.",
"A random humanoid hiking down the road. He waves pleasantly. He lives nearby.",
"A gnome whittling a pipe from a strange blue wood for his uncle. If you ask nicely he points out a grove of blue ash trees nearby. He also warns you of a dangerous bush that attacked him the last time.",
"A dead horse, complete with saddle and barding. Further up the road, a courier with a letter for a nearby kingdom. He begs your help in delivering the letter. He ran the horse to death, his need is so great. The letter is a plea for peace. If not delivered, two kingdoms will go to war.",
"A weeping willow. That is actually crying. A nearby druid is trying to console it, but is at a loss as to how.",
"A pack of wild dogs follow the PCs for a while. In the morning, a puppy with unusual markings is found snuggling up to a PC.",
"A large rabbit pops put of a nearby hole. It consults a map, shakes its head and dives back into the earth.",
"A single dinosaur of your choice is wandering about someone's farm, scaring the cows and the farmer. Triceratops is a good choice.",
"A field of black corn, tended by orcs. They seem friendly and offer to sell you some.",
"An odd pile of twigs. They animate and attack if approached. They can't fly, so they go for ankles. Slowly. The wizard who created them sits nearby, questioning his life choices.",
"Two elves gracefully glide by. One of them trips on a raised root and swears loudly. The other one laughs.",
"A large earth elemental is crooning at a nearby boulder.",
"Several farm boys throw eggs at you. If threatened they go tell the local hamlet, which comes at you with pitchforks and torches.",
"Someone has swapped the teetotaler Paladins waterskin with moonshine. It wasn't the Rogue. Antics ensue.",
"A rival group of adventurers rides by on fine horses, deliberately kicking up dust in the PCs faces.",
"A clear cut section of forest is being replenished by a single druid, who is fighting through tears to plant acorns.",
"The road is blocked by a massive pile of logs. A cloud giant demands tribute or alcohol. Preferably alcohol.",
"Several maps are strewn around an old campsite. They are actually fake maps left behind when another group was comparing notes and found inaccuracies.",
"A large sign saying Welcome to Davis' Dry Goods! stands near a large field. There is nothing else.",
"Meteor strike.",
"Two drunk goblins sit on a barrel, making lewd comments at any passerby.",
"The sun suddenly goes out for about five minutes. Weeks later you hear of an epic battle between a death cult and some adventurers where they tried to put the sun out and almost pulled it off.",
"A whole bunch of rocks come tumbling down a nearby cliff. A ranger is caught up in it and is trapped by a fallen tree.",
"You stumble upon what looks like the site of a battle between two ogres and a border patrol. Several shattered pieces of armor, two dead ogres covered in buzzards and three hastily dug graves are evident.",
"A large pit in the middle of the road. It's actually an illusion cast by a bored sorceror, who is watching to see what happens.",
"A random potion explodes in someones backpack.",
"An ooze is approaching. It just killed and consumed the remains of a Dwarven alchemist. His bandoleer of potions and oils is trapped within. As the ooze digests the corks, random potions take effect for the ooze.",
"A group of half orcs is dumping garbage in a nearby ravine. Monsters are attracted to the smell. Fortunately, the ravine is almost sixty feet deep. If you peer over the cliff you can watch a displacer beast fight two digesters.",
"On the way into town, the party comes across a weary elf leading a donkey and cart. In the cart are two rambunctious half-elf toddlers. Their father is in dire need of a break. If the party offers to entertain the children for a bit, such as by singing songs or offering them a snack, the relieved father will give each party member 1gp.",
"Upon entering the tavern, the party hears a loud commotion. A belligerent old dwarf is, to put it mildly, upset about being cut off by the bartender. There isn’t anyone quite strong enough in the tavern to remove the dwarf from the premises. Drinks are on the house if the party gets him out the door.",
"In the market, the party overhears an argument at the potions stall. A violently chartreuse halfling is demanding her money back from the shopkeeper. It seems the potion was not of Greater Healing, but of Greener Healing.",
"Children are kicking a ball around in the street as their mothers watch. One boots the ball too hard and it hits a party member in the head. Now his mother is marching him over to the party to apologize.",
"A goblin has tied one corner of a blanket to each limb and is about to jump out of a tree. The success of his parachute is up to the DM.",
"Traveling through the desert the party sees an airship being attacked by a blue dragon spitting lightning at it. One of the balloons burst and the airship starts dropping but the airship gets off a lucky shot with a mounted ballista and shreds the wing of the dragon and it crashes into type ground. The airship makes contact with the top of a dune but manages to gain altitude and fly away.",
"As they travel along the road, they find a man trying to get his over-turned cart out of the ditch. They can see along the side written in common are the words \"Pemberton's Potent Potions\" and glass bottles of semi-clear yellowish liquid strewn about the mud. If they help, he offers a free bottle for each. If/when they ask what the potions do, he responds, \"What do you need?\" and will swirl the bottle in his hands, changing it to what they need. However, too much of a good thing is often bad. The potions are highly addictive, and need his special touch to be effective.",
"This one is stolen, but a frazzled man dressed like a stereotypical wizard falls from the sky into a bush nearby. When he stands and brushes himself off, he looks to the group saying that he remembers them from somewhere they've never been. He remembers them from somewhere they're supposed to go in the story in the future. It's just a reverse railroad mechanic ;).",
"As the characters are traversing the dungeon, they overhear a conversation from an alcove up ahead. It seems it's one of the bad guys' first day back to work since his children were born and he already misses them. His co-workers reassure him that it's only a short ten-day until he can get back to them, and with a decent wage.",
"In the market, they find someone selling various canvas paintings. All of the paintings were done by the seller. They all have a common red theme and appear gruesome in subject. Some of them even look to be of people screaming in abject pain and horror. Upon closer inspection, they can see the red tint in the paint is actually blood.",
"All of the town's workers are on strike. They've had enough of the local tyrant's awful treatment and low wages paid. While a little girl sings songs of protest in solidarity with the workers, a larger man is standing at a food tent chanting and demanding food, bashing his fists on the wagon.",
"While on night watch, a well rolled perception check lets the player hear the flap of leathery wings and a roar (conjuring the image in their minds of a dragon ideally). Upon further inspection, they see up in the sky, two wyverns in the middle of copulating.",
"The party comes across a handful of carts and wagons on the road with a group of merchants arguing over a broken wheel of one of the wagons. As the party gets close, the merchant's attempt to pull them into the argument (could be over a road they don't usually use, maybe one got fed up by another snoring too loudly and the wheel was just the catalyst). If the party successfully helps, they offer a small amount of money, if they are unsuccessful or refuse to engage a handful of insults are directed at them but they are otherwise left alone.",
"The party comes across a group of carts and wagons on the road. A (seemingly) group of merchants stand arguing over a broken wheel. As the party gets close, they are ambushed by a group of bandits.",
"The party sees in the distance a legion of soldiers marching towards them. If they pass by the legion, a captain comes up to speak to them and promptly orders a tax of gold or goods.",
"The party finds a small camp by the side of the road, tents torn apart with claw marks in the fabric. Leather satchels are strewn about ripped open with claw streaks on the leather. The players can find a few days rations, and a mostly torn up cloth doll missing an arm.",
"Up ahead the party sees a ramshackle tavern with a rough looking thug standing outside the door. If they approach, the thug tells them to move along. (Passive Perception X: They hear muffled scream inside the tavern.) If they get past the thug and enter, they find a handful of bandits with crossbows and short swords inside robbing the tied up patrons and barkeep.",
"As they travel, a large shadow passes over them. When they look up they see a giant eagle flying above with something clutched in its talons.",
"As the party travels, they see a man running down the road bruised and battered. As he gets close he is heard muttering and sobbing to himself. He tells the party to not go forward, that there is a troll/giant attacking the village/town. When the party gets to the town, they see a troll/giant smashing some people against the ground and chomping into their flesh, and a group of men with pitchforks trying to fend the creature off.",
"As the group travels they come across a bridge over a small creek, a farmer and his daughter sitting on the edge fishing. If the party is friendly, they give them a fish and a handful of wild berries (1 day ration).",
"The party sees in the distance a carny group settled down for the day. As they approach, a handful of the carnies come out to greet them and ask if they would want their fortune read, to see a card trick, to watch them juggle etc.. If the party does, one of the carnies attempts to steal from the party (carny sneak vs. passive perception or vs. a perception check if the PCs seem wary of it).",
"In the distance the party sees a small caravan with an owlbear in a large cage. A group of men and women are outside of the cage attempting to wrestle the owlbear down with ropes and spears as it attempts to break free from the cage. As they approach, the owlbear breaks free and attempts to run away, or fight whomever tries to stop it. (The owlbear is slightly wounded)",
"Another adventuring party passes by on the road. They seem to be relaxed, but are rough around the edges, the visage of a long journey coming to a close.",
"The clanging of metal can be heard in the distance. A mercenary company seems to have camped in the area and are taking in and training new recruits (possibly for x conflict the party has heard of).",
"Along side the road is a small smithy. The walls are covered with the standard stock needed by farmers and other rural folk. Inside are two fledgling adventurers, brothers acquiring equipment from the forgemaster for their first foray out into the wide world.",
"A medium size village is found at a crossroads, just recovering from a festival, celebrating the send off of the two brightest lads in town to a better future. Their father is still drunk and full of pride in the local tavern.",
"As the group closes in on the city, they encounter a young woman driving a cart, delivering milk from her farm into the city.",
"Party comes across a ruin with low altar. Upon 2 of party solving small puzzle together on altar, they can feel a bless spell come over them. Secret room opens to reveal a hidden bedchamber. They're married now.",
"I love the idea of camping with another group of adventures for the night. Introduces a great way for a DM to add some plot hooks and rumors to checkout. Maybe even having a battle encounter with the each of the groups doing their thing, revelry afterwards, and a easy parting in the morning. Kind of like a 1 night stand for friendly adventuring groups.",
"While traveling down the road the players come across a large progression of caravans flanked by armed guards heading to the nearest trading city. In the middle of all these carts is a rather rotund man in fancy purple clothes on a large white horse. He demands the players get off the road as he passes. (This is really a test of stubbornness for the PCs) If the players move out of the way the man is pleased . If the players refuse to move the guards attempt to move them, with or without force is up to you.",
"As the party traverses the road they come across a colorfully dressed man hocking his magical goods. If the players talk to him he opens a box full of tiny living animals and he has any tiny animal the players could want for only 1gp each. After buying animals from him they will last for 1d20 minutes before disappearing. The colorful man will not be there if they go back to find him. (This started a lifelong side quest to find and kill this man in one of my campaigns)",
"Upon entering a tavern the party is alerted to loud cheering coming from the corner of the large room and see a large crowd standing in a circle. If the players go over they see a table with a halfling and a goliath arm wrestling with a large bag of gold sitting by the halfling. The halfling beats the goliath and begins calling out to see if anyone else wants to challenge him. This halfling has an incredible magical ring granting him +10 to all strength checks but it is bound to his soul for all time.",
"While travelling through the forests the party comes across a large boiling pot. If they decide to taste it they acquire a minor debuff to all skill rolls for the next 24 hours. They are not notified of this debuff right away. If they stay long enough they will be chased off by the powerful witch brewing it coming back with more ingredients for her curse potion.",
"A woman is standing near the side of the road winding a large music box. A monkey is tied to a post next to her laying on the ground. The monkey is actually this womans husband who she had cursed into a monkey after she found out he was cheating on her.",
"If passing a low perception roll, the party hears the faint sounds of music and merry making coming from a completely empty field. If they investigate by going into the field they pass through a portal to a pocket dimension that seemingly is in the same spot but now full of a ragtag group of people around a large bonfire. A spindly looking elf spots the party enter and they are offered food and safe rest for the night. Upon leaving the dimension the portal disappears and can not be reentered. (Could lead to a recurring group of dimensional travelers?)",
"The players wander into a group of glowing lights in the forest. The lights whirl around the party before slowly moving deeper into the woods. If the players pursue they will be led to an abandoned shrine to a minor god with a ragged skeleton laid upon it in the robes of this god.",
"In the city a man calls to the party from a nearby alley. He offers to sell them magical items at low low prices. All of his items are fake but do eminate a small amount of magic if Detect Magic is cast on them.",
"A beggar sits on the city street with a sign that says \"Your generosity will bring you luck\" with a large copper pot sitting in front of it. If a player donates to the pot they will gain a variable buff to a random roll of your choice in the future based on how much they donate. The copper pot is ancient and enchanted. Stealing it will lead to serious misfortune.",
"The players run across a haggard man on the road. It is a god/goddess in disguise simply playing games with random passerbys. The man begs the party to help him catch the sun or some equally ridiculous task and tells the party he may die without their help. If the party successfully figures out the riddle they are rewarded with a blessing from the God, if they ignore the man's plea it may come back to haunt them later if they have to interact with that god again.",
"A bird perched in a tree in the woods is /screaming/ and it sounds human.",
"The ringleader of a traveling circus warns the party that their gorilla escaped into the nearby woods recently and mentions they'd reward someone who could bring the gorilla back. The gorilla is a man stuck in a suit.",
"The party spots a huge form far in the distance that soars through the sky at breakneck speed.",
"An ancient dwarf wanders the roads in a set of rusted armor that was once quite elegant. He carries a battered warhammer and is seeking someone to give him a glorious death in battle before he is too old to even fight.",
"A little ways off the path in the distance is a large assortment of tents and makeshift buildings. A wizard tournament is being held here where wizards from around this small region gather to show off their power.",
"The players enter this tavern and above the mantle of the huge fireplace is an enormous head of what looks like a dragon. The head is a fake. In front of the fire sits a fat old gnome who will waffle on about the challenge of killing that dragon. This man is the owner of the tavern and does this all day every day.",
"A large tavern sits at a crossroad on the party's path. If they have a map,this tavern isn't on it. A sign reads \"Rough and Ready Battle Tavern\". Inside there are several huge rings full of combatants and several dozen hulking figures gathered around all these fighters drinking and cheering. There is currently a battle tournament going on and the party is welcome to enter. No magic allowed in the tavern.",
"On the road, the party hears a loud thudding sound approaching from around a bend. When the party or the thing clears the bend, the party sees a golem (or huge clockwork construct) with a gnome in a harness on its shoulders pulling a loaded wagon behind it. The gnome is a traveling merchant who relies on the golem for conveyance and protection.",
"In a tavern, the party encounters a beautiful serving girl who enjoys flirting with patrons, yet any men who try to reciprocate her playfulness earn a glowering stare from a knight in white enameled armor sitting at a corner table. If a party member propositions the serving girl, the knight rushes in to defend her honor.",
"On the road, the party encounters an old woman tending a garden in front of a hut. The woman is an herbalist who sells basic healing potions and poisons to passersby.",
"On the road, the party encounters four goblins standing around a small fenced enclosure that holds a snarling warg, which the goblins are trying to tame for use as a mount.",
"Along the road, the party happens upon a bridge that collapsed in a recent flood. Two workers are having an argument and are on the verge of coming to blows. One insists stones from the local quarry would be too expensive for the village to afford and the other contends that the stones in the creek are the wrong kind for building with.",
"Demon Chicken: The party stumbles across a small clearing. At the center of the clearing is a chicken. The chicken is a (poorly summoned) avatar of the trickster god, and is docile unless directly attacked. As the party approaches the chicken, ominous events begin to happen (ex. sky darkening, chickens gathering around the clearing, etc.). Attacks against the chicken are mysteriously deflected back to those who made the attack.",
"Cultist Interns: A group of amateur cultists stand around a pentagram, trying to summon a demon, They have no idea what they're doing, and are trying to get enough experience to start an apprenticeship at a cult. \"Need experience to get experience\". Any blood spilled on the pentagram will speed up the summoning of the demon. The demon summoned is a demon chicken. Perhaps the cultists have an item to banish the chicken from the plane?",
"Cultist Recruiters: Figures in freakishly black robes (think vantablack) pass the party on the road. They are cultist recruiters, who are travelling to a major city in search of talented young evildoers to take under their wing. Work is unpaid at first, but has potential for a permanent position. They will formally interview potential evil candidates on-the-spot.",
"Church of Humility: In the deep wilderness, the party sees an abandoned church in a clearing 100m off the path. No matter how far the party travels, the church appears no closer, yet they do appear to go further into the wilderness. After an entire week of travel, the church finally grows closer. One they enter the church, they find it full of skeletons and high-level loot, and find a single piece of parchment reading \"Confident though he may be, a man who travels without humility travels not at all - Ephystices\". Upon leaving, they find that no matter which direction they walk, they always end up back at the church. If they leave an item they value in the church (without taking anything else), they appear to be travelling. Either choice requires a single day journey in any direction to return back to the trail.",
"They find a beautiful ivory-white tree with rainbow petals. They must pass a low wisdom saving throw to look away from the tree. Each question a party member asks about the tree increases a character's required saving throw. When a player fails a saving throw, they become further enamored by the tree. A party member's resistance to leave the tree grows for each failed saving throw, and will make up any reason to avoid needing to look away from the tree. The tree's bark, wood, and leaves are highly coveted by artisans.",
"The party meets a well-dressed man who claims to be the prophet of a trickster god. The man gives the party factually true information about any question they ask, but relevant NPCs are made aware of the party's questions by the very same prophet. If attacked, the man instantly vanishes in a puff of smoke.",
"Curiosity killed the cat: The party sees three wooden signs at varying points on the road of signs. The first sign reads, \"Please stop reading these signs\". The second sign reads, \"For real, stop reading these signs\". The third sign reads, \"Well, there goes your hair\". The party members who read each sign lose all of the hair on their bodies. In the next town, they meet someone who has suddenly grown the hair they've lost, mourning the death of his cat.",
"Freeing the BBEG: The party meets a complete idiot dressed in rags, starving in the wildreness. Barely able to form sentences, the man claims to be a prophet of a trickster god, and that he is the most intelligent person alive. He challenges them to solve his riddles, promising them good luck for the rest of the day. Every time the party succeeds, the man grows markedly more intelligent and composed, giving them a more challenging riddle. The man is desperate for the party to continue guessing, but loses intelligence every time he encourages or coerces the party to guess, and cannot explicitly state his curse. On completion of the fourth riddle, the man thanks them for their help, and vanishes in a puff of smoke. If they succeed, the party is very lucky for the rest of the day.",
"A man races up to the party, waving about a flute. He desperately attempts to give them the flute, but flees upon being attacked, dropping the flute. If the flute is played, any bard which hears it must succeed on a high charisma saving throw. On failure, the bard begins playing the nearest instrument uncontrollably until he cannot heat the flute.",
"The party's rations inexplicably rot overnight. The following evening, a peaceful woodland animal (ex. deer) approaches the party, following them at a distance and aiding them when needed. When the deer takes damage, it is unable to die, regardless of it's massive wounds. Despite its pain, the creature will follow the party to the best of it's ability, no matter the circumstance. Attempts to heal the creature have disadvantage.",
"One night, the party hears a woman crying for help in the forest. The screams sound oddly similar. Successful low skill checks determine that the screams sound exactly the same, every single time. The direct route to the screams is riddled with traps. Once close to the screams, they see an outline of a human standing eerily still, and the screams grow silent. It waves, but the movements are very rigid. Upon close inspection, it is found that the outline is made from clay. The clay creature attempts to eat the party members alive, and has the same stats as a clay golem.",
"Party is traveling and is being stalked by a tribe of bugbears. The bugbears, because they’re bugbears, are gathering their numbers and preparing to strike and leave no survivors. As the party continues to travel, the number of bugbears increases, both making the fight to come more difficult, but the bugbears more likely to get caught.",
"The party hears giggling and excited screams. If they follow them, they come across some teens/young adults swimming in a sheltered pond.",
"The party discovers a coin purse on the side of the road. Inside is some coin and a note \"Please return to Wilhelm in [City Name]\".",
"A worker in front of a store is hawking the great benefits of their beauty parlor.",
"The party stumbles upon a parade which commemorates myths, fables and important events within your setting. In the same vein, the party stumbles across a statuary park/museum with statues or busts of all the famous kings, wizards, adventurers etc. Think the Hollywood-handprint-thing but of your brilliant cast of famous npc's.",
"Whilst walking through a rural area the party find a secluded set of ancient crumbled stones forming a circle. Within the circle floats a medley of natural debris for the environment like leaves, twigs and the occasional coin. When stepping into the circle，gravity reverses on that person and they float to a maximum height of 20 feet. They are moss covered and weathered but an arcanist investigating them finds wards of abjuration and conjuration carved in ancient text.",
"A group of travelling monks, heading to the peak of the nearest mountain carrying incense and contributions.",
"One of the king’s guards (or similar) rushes by in an urgent fashion. He does not stop for the players and will not hesitate to attack if they stand in the way of his important message to be delivered.",
"The players start to hear tremors and rumblings. Eventually, a Xorn reveals itself. It is not hostile although holds its mouth wide open. It will flee if attacked, however if the players feed it valuable metals such as coins or ore, the xorn will gesture thanks to the players and burrow back away. It may later reappear to help the players in need.",
"The party passes a colourful covered wagon, steered by a friendly Kenku junior brewer. She would be willing to share some of her beer if the players ask nicely, especially if it's getting close to dark. It's quite good beer. She works for the Sproutfeather Brewery, a moderately well known local brand.",
"A group has pulled aside and set up camp beside the road despite it being midday. Screaming can be heard. In the camp are about a dozen halfling travellers and their wagons, which they appear to live in. The screaming is coming from inside one of the wagons, where a woman is giving birth. They'd hoped to make it to the next town before this, and have no healer. Any aid the heroes offer would be met with sincere appreciation.",
"On the road the party finds an overturned carriage with blood smears and claw marks, the horses are missing or mutilated. If the party investigates the (blood) trail leading into the woods they will stumble upon a werewolf about to kill the lone survivor of the carriage. If the party has no silver or magic weapons then they can't kill the beast but can hold it off long enough for the victim to escape. However any wounds inflicted on the party members by the wolf will transmit the curse, and the next full moon they will transform.",
"The party comes across a farmer on his way to market, but the axle on his wagon has broken and he's stuck at the side of the road with a wagon full of produce.",
"The party hears roaring from in a forest. Tracking/ following the sound brings them to a bear with a paw caught in a trap.",
"The party sees a young boy traveling down river in a canoe with a bag of clothes and a stuffed owlbear. If they talk to him, he will explain that he is running away from home because his mom keeps making him clean up and it just isn't fair.",
"The party sees a very distraught child calling for a lost kitty. Good survival checks to track it can find the cat in the roots of a tree nearby nursing a litter of kittens.",
"The party settles in for a long rest, only to be set upon by a skunk. Each character rolls dex to avoid getting sprayed. If sprayed only gain effects of short rest. Disadvantage on stealth checks for the next 72 hours unless magically cleansed.",
"As the party travels through deep woods, a character with high passive perception notices a beautiful wedding ceremony out of the corner of their eye, in a clearing that is just beyond some particularly dense tree growth. If they turn back to get a better look, all that they find are dead flowers and a couple of ancient skulls and assorted bones. Cursed wedding rings are optional.",
"There’s a person laying by some cacti on the outskirts of a desert. It’s the corpse of a druid covered head-to-toe in cactus needles after a spell went awry. (If desired, the animated cacti surrounding the party can attack.)",
"A young girl in a cloak runs across the party’s path from the woods on one side to the woods on the other, followed by a wolf. They are far too fast for the party to catch.",
"Walking through a town or city, there's a large bang from a nearby, oddly constructed house. As black smoke starts billowing out of all the doors and windows, a gnome, clad in goggles, stumbles out coughing and spluttering and falls to a heap in the ground. She seems ecstatic, though, and yells at the top of her lungs that this is cause to celebrate!",
"There is a hawk on top of the fountain in the town square, watching what is happening beneath it. A group of halflings is rolling a wine barrel and carrying plates of food to a party across town. The barrel gets stuck in particularly stubborn set of cobblestones, so the other halfings put down their plates to help. The hawk sees his opportunity and steals a plate of expensive looking cuts of meat.",
"Sitting in a tavern, a loud crash is heard from behind the bar. The cook bursts out from the kitchen, swinging pans and swearing loudly, chasing a number of kobolds (I like kobolds, goblins, imps, mephits or any other small creature would work fine too) who are carrying any number of kitchen implements. They leave a trail of salt, spices and alcohol in their wake",
"A travelling duo of sharply dressed bards named The Lute Brothers is playing in town tonight. There is a shady sorceress following them, seemingly trying to kill them. They travel in an old town guard black maria, pulled by strong draft horses, claiming to be on a mission from the gods.",
"The party comes across an old man and a much younger woman. The younger woman is his apprentice and they brew potions. The party can pay the apprentice to brew 1 random potion (determined by dice roll)",
"The party comes across an archery tournament, where local villagers have come to show off their prowess. They can enter for a price and a set of arrows is the prize.",
"While the party perusing through wares in the market square, an urchin nicks something of minor value. While the merchant and guards give chase, someone sneakier moves on the unprotected goods and takes the more valuable items.",
"A drunken local is pestering citygoers. He's sloppy drunk and very handsy, but a keen eye will see he's got a hand in his target's pocket.",
"A crowd is gathered at an inn that you pass by. Guards aren't letting anyone in. From the murmurs you hear, there was a murder in one of the rooms last night.",
"A priest/priestess walks around gathering alms for the poor and asks the party for a donation. They may or may not be legitimate.",
"Guards are pulling apart two gamblers, both of whom are accusing each other of cheating. Upon closer inspection, they both were.",
"The party wakes up after camping for the night to find a Kobold-run shop on the back of a Bullette has literally popped up from the ground nearby. They sell all manner of knick knacks and a couple potions.",
"An old stone bridge crosses a river in full spate at its narrowest point, making it the only way across in many miles. Unfortunately, a pair of knights are currently blocking the path and hurling insults at each other - apparently they are brothers, who were to inherit the bridge and the income from the tolls that comes with it, but the wording in the will was ambiguous enough that they can't come to an agreement over who is to own it - so they ask you to fight the other brother for it in their name. They won't fight each other, after all they are still family.",
"On their journey, the party crosses through an old stone arch in the middle of an ancient forest. Unbeknownst to them, this old stone arch still holds remnants of old magic, and has a 20% of sending anyone who walks through it into the Feywild.",
"Climbing a mountain pass, the party might come across a group of stone giants playing a game of boulder tipping - unfortunately for them, these boulders rain down onto the pass the party is travelling on.",
"An old, withered beggar wanders the street, asking to accompany the party for a while and pleads for some food and shelter. Should the party comply and grant him shelter for a day, he will thank them and reveal himself at the end of the day as an ancient silver dragon and grant the party a reward for their random act of kindness.",
"An unlikely and curious duo - a kobold tinker and an orc peddler named Snottspill and Borgrel rest beside the road are having an intense philosophical discussion about the prejudices their people face in these adventurer-dominated times.",
"A lizardfolk warrior travels along the road, a stash of posters on his back, one of which he may hand a passing party member: in it, a powerful red dragon promises a reward for those adventurers who might help him settle a private dispute with a neighbouring dragon.",
"A protest march by a nearby druidic-elven community is blocking the street, demonstrating against a recent treaty the king made with the dwarves, to fell their forest to fire up the dwarves forges in return for a reduced cost on their adamantine shipments.",
"A man in a long robe flies out of the trees to the left, riding a magic carpet. He speeds right to the other side and disappears. Shortly after, a very short gnomish man with a bushy moustache puffs out of the same left trees, yelling \"Wait for me ______!\".",
"The grass along the road seems to point towards the nearest living organism. 60 feet from the road, the grass starts waving wildly in all directions.",
"A mist rises up and settles in, thick enough to block some light from above. Seemingly harmless bolts of electricity snake their way through the vapor, moving in all directions (and often running along metal objects, leaving behind a tingling sensation if the objects are worn or carried). Boltleaf Plants may be found sporadically in this area.",
"The sky on the horizon slowly fills with clouds which dim the light. Plants are much shorter than normal as the party moves towards the clouds. There is a magically defined border here, visible through the clouds which meet an invisible wall and split along the face for several miles. Rain pours down in a distinct sheet. The party has no difficulty crossing the line.",
"A party member hears a voice in their ear whispering for them to set down their weapons and leave the area peacefully or else. Upon investigation, they may find a cricket perched somewhat hidden near their ear. This cricket speaks common and draconic.",
"There is a bridge that crosses a river on the players path. A group of hammer wielding men is blocking the path and demanding a toll of 10 gold per person. They are a local artisan guild and are raising funds to restore the bridge.",
"A sad green dragon wyrmling, who is convinced he will grow up to be an evil tyrant. Party could try to make him feel better and strive to be better.",
"A grumpy dwarf who wants the rats cleared out of his house. In truth the 'rats' are a particularly mutated vrock hiding in the basement, and the dwarf is a cleric who trapped the demon there, but was unable to deal with it.",
"An old man wants to buy a dog. Not just any dog. But a magical dog.",
"The party finds a hat-maker hastily preparing a crossbow. The local shoe maker has challenged him to a duel.",
"An orc and a hobgoblin are traveling together. Contrary to expectations, they're a comedy duo. They aren't very funny.",
"The party walks through the woods and notice lights between the trees. Closer inspection reveals the lights to be gnarled hands jutting from the ground holding lit lanterns.",
"A group of orcs are seen fighting each other. Upon approach they break up and begin shaking hands. They were mock fighting it seems.",
"A lizardfolk sits on the side of the road asking travelers to engage in a staring contest with him. He doesn't blink and instead licks his eyes to wet them.",
"As the party walks under a copse of trees, a multi-colored cat with butterfly wings struts out of the brush before meowing at the party and flying up into the trees. This is actually a minor illusion created by a family of faerie dragons to mess with travelers.",
"A traveling merchant attempts to sell a myriad of small animals to the party. After 1d4 days, the animals revert back to their original humanoid forms. These people were turned into animals by the merchant.",
"An adult green dragon has claimed ownership of a forest filling a nearby pass between mountains. Nearby locals will warn the players to spend a few extra days to go the long way, but if they take the short cut then the dragon will confront them to collect the roll for traveling through its woods. It is civil about it, if they are, and is always looking to expand its collection.",
"As the players are traveling through a remote region, they begin to hear an echoing whistle riding on the wind. Following or seeking it out will lead them well off the trail, and risks getting them lost in the wilds. Despite the whistle getting more clear as they chase it, and discovering some signs of something having recently moved through the underbrush, they never actually see what's whistling.",
"The players find a small cabin, connected to the main road via a long and winding path. It's fully stocked by the local nobility, with firewood by the fireplace and smoked meat in the cellar, but the noble's hunting expedition won't start until the end of the week.",
"Some of the local children approach the party and marvel at the \"actual real adventurers.\" The children trail the party for the rest of the day, asking for tales of their exploits.",
"One of the local children attempts to conscript the party into helping them find their lost friends. It turns out, they were just playing hide and seek.",
"The party stumbles upon a stray dog, who takes a liking to a particular party member.",
"A young fan of the party asks for their autographs. This fan idolizes the party members.",
" A talking bear asks the party to help it acquire maple syrup. The bear is friendly, and will understand if the party does not wish to do so.",
"The party travels somewhere in the wild, when suddenly their chatter awakens some sort of an extremely hungover bard in a nearby bush. If the party moves stealthily one of them notices a sleeping bard or steps on him. The bard is from another world or at least from another continent and doesn't remember how he got there.",
"Traveling across a desert the party notices a merchant caravan heading towards them - and it looks like they are heading in the same direction. They can take a break for a few hours and join the caravan.",
"They meet a person of an unusual race (such as a snow elf in the desert or an air genasi on the Plane of Earth) in a tavern or at an inn. She is friendly and knows a lot about faraway lands - as a wee young lass she swore an oath to a god of travel and has been on the road ever since.",
"An old soldier guards a bridge/ford/ferry - he was posted here a long time ago with his squad and they were never relieved. The rest deserted/died/live in the nearby village an sometimes visit. He's got an orchard, a few cows, and a strong friendship with the river dragons/fey who value his sense of duty.",
"A pack of perfectly black lions attacks the party out of nowhere. They turn to dust after a short while or a single strike, leaving only their eyes of onyx.",
"An old shrine of a forgotten god stands at some distance from the road. A herd of goats walks around, and the sheperd - a young boy with goat horns sitting on the altar - yells something in an unknown language. If approached, he hops off the altar and repeats \"Hello, sirs\" - and he doesn't have the horns anymore.",
"An earth elemental is holding up a huge stone. It was summoned by an archmage to provide some shade on a sunny day, but now it can only be free if \"the Sun explodes, I [the archmage] catch on fire, or the world ends\".its so hot right now dammit ugh",
"A group of monks on a pilgrimage set up camp just off the road - it's a mobile fortress made with carts nailed together with metal shields. They worship a god of protection and like to always be well protected.",
"PCs travelling on a road encounter a horse cart that is stopped. The road in front of it is impassable due to recent storms. If the PCs repair the road, the driver writes them a thank you note and tells them \"If you're ever in Villiage Name, this should help get you a warm welcome\"",
"PCs notice that the wilderness around them seems oddly orderly. It is not manicured, but there seems to be some art and symmetry to the plants and trees around them. They have wondered into the garden of an elderly wood elf hermit, who is watching from a distance and will chase them off with curses if they harm the plants. If cursed, players get -1d4 to ability checks for 48 hours. If they act kindly to the garden and/or wood elf, they are blessed for +1d4.",
"The party encounters a cave. There are dirty adventurers' clothes and a pack strewn on ground outside the cave. Adventurers enterring the cave find nothing, but save against very light damage from stumbling into sharp stalagmites. When they exit the cave (or if they just wait outside for 5 minutes), a wet and unclothed adventurer returns to his clothes and explains he was swarmed by bees and jumped in a stream to escape them. If the PCs steal his gear, they find something similar to starting equipment for a lvl 1 adventurer, but the poor guy dies.",
"The party stumbles across the ruins of an old monument. The writing is too worn to recognize, but it seems to commemorate a local folk hero. A difficult Int(his) check might reveal that this hero saved a local town from Appropriate Monster Race attacks. It seems a few alms have been left at the statue a long time ago. The party can collect a few gp worth of alms, do nothing, or leave alms for a small combat bonus against the monster race only if they pass the INT(His) check.",
"The party passes a travelling salesman on the road, a halfling named Doctor Bosco Twomey. He is offering half-price healing potions. DC 20 Insight check reveals he is a scam artist. If they miss this and buy healing potions, roll 1d6 each time they use a healing potion they bought from Bosco. On a 1, the potion gives no HP and they have the poisoned condition. On a 2 or 3, there is no effect. On a 4/5/6, it acts like a normal healing potion.",
"A local child follows the party from a distance, trying but failing to be stealthy. He won't approach them willingly. If the party continues travelling at least 1 mile, he stops following them. If they confront the kid, he is terrified, pees himself and starts crying.",
"The party passes a small rural place of worship with a few gravestones outside. It looks abandoned. No mechanical effects, but use the epitaphs on the tombstones and the holy symbols / texts / decor to flavor your location or provide some light exposition.",
"There are sounds of celebration over the next ridge. A village is celebrating a seasonal fair. Your party can try to win a stuffed dragon by ringing the bell in the strength contest. 2sp fee per try. Or make it an eating contest (CON challenge), or performance, etc.",
"The party passes by several \"no trespassing\" signs. If they proceed, there is a tripwire that drops buckets of deep purple fermented berry juice and jam that stains any fabric it falls on, and reeks to high heaven.",
"The party trips an arcane alarm, causing a repetitive siren noise. It is completely unclear what or who this siren was protecting, or how long ago it was set.",
"An NPC stands atop a soap box, exclaiming that he can offer adventure to those who dare accept it. Most PCs will mistake this for an obvious plot hook and eagerly inquire further, only to learn he’s simply advertising a play at the local amphitheater.",
"A seedy merchant is selling an assortment of unrelated items— among them a seemingly innocent jar of honey. Although you may have to devise a creative way to bring it to the party’s attention, they will discover upon consuming it that it’s really the hallucinogenic mad honey. Whether the merchant actually tells them this is up to you.",
"An ancient yet beautifully-crafted instrument once belonged to a renowned musician, and now a supernatural echo of himself provides it with sentience. When played, the instrument often goes on melodic tangents against the handler’s will, but over time it can learn to respect and even grow fond of the handler, causing it to be more compliant and oftentimes helpful.",
"If at sea, the party may encounter a previously mutinied ship captain stranded on a raft. If they agree to let her aboard, they may find that she happens to be either a horrible person or incredibly annoying— either way they should start to sympathize with her former crew.",
"You find a pair of halfling children who have lost their family’s mastiff. They ask you to help retrieve it.",
"You come across a small signpost engraved with the visage and symbol of the god of travelers. Placing an offering will have the DM give the party a more favorable outcome on their next random encounter roll.",
"A beggar beseeches your party for food, drink, or coin. If they give them something, they transform into an angel, and bestow upon them a minor but not insignificant boon. If they refuse, they still transform but instead fly off, leaving the party with only knowledge of what they have lost.",
"The party comes across a baby owlbear, separates from its family, scared, and loudly crying.",
"The party comes across a little half-elf girl (probably 8 or 9) on the side of the road. She's starving, and wearing ragged clothes and begins to cry as the party approaches. \"I knew it! I was bad and I ran away from home and now I'm gonna get gobbled up by monsters!\" She's sobbing, and the party has to convince her that she's safe and they aren't monsters, and if they do, she begs to go with them to the next town, where's she's from. She slows the party a bit and eats an extra bit of food, but ultimately, when they reach the next town, she drags them to her house, where her parents are elated that she's returned and offer to provide room and board for the party (within reason) as the only way they can afford to compensate them.",
"Fizzlebang the Magnificent's Discount Potions and Knicknacks! He sells health potions that work, but make your hair fall out, scrolls that almost work, a tiny \"magic charm\" that's actually a tiny mimic. Many other questionable items abound.",
"A man, dirty and wearing rags, is trapped in a wooden cage hanging from a large tree. Nearby a large cauldron sits atop a burning fire. The cauldron boils and pops, and the air carries the smell of cooking food and something acrid.",
"Party comes to a section of a well traveled path, that is through open plains with rolling hills, has divits as if giant bolders had landed their but there was nothing in the divits and had to continue on.",
"Off in the distance you see a manticore cycling something. As they rush up to see if there are any one in danger, multiple arks of lightning strike it from the ground killing it instantly. While the plan their next move 8 mages (sorcerers or warlocks can do) in dark blue come over the hill that blocked their veiw as if nothing of importance happened.",
"A small boy run out of a tent carrying a knife and is charging the group. if they subdued the child the cleric or equivalent can assist in the exorcism. Killing the child would invoke penalties in town and sorrounding areas.",
"A nearby village is holding an art festival. There are prizes for the best painting, sculpture, and “unique entry”.",
"While traversing a dense forest, the party spies two gnomes walking quickly toward some unknown destination. One carries a walking stick and stumbles frequently; the other walks in front, leading the other by a chain attached to their neck. Behind them, something large and unseen crashes through the forest, closing in.",
"One morning, while crossing a small bridge, the party hears the sound of weeping and wailing coming from below. When they pause to investigate, they discover an old man, naked and cross-legged, sitting on a large rock with a jewel-encrusted sword laid across his legs. His legs are bleeding.",
"While walking alongside a shallow river, the party sees a beautiful horse with a braided mane drinking. When they come closer, they see the horse has no saddle. Without raising its head, the horse says ‘you’re going the wrong way, you know’, then slowly crosses the river and disappears behind a low hill. On the hill stands a woman, holding a basket.",
"The party meets a small group of children on the road, of the same number as the party. They challenge the party to a game of hide and seek, promising a hefty bag of gold if the party wins. Strangely, the party notices that the children are dressed exactly the same as the party—except one of the children wears a long gold necklace holding a green jewel.",
"On a cold night, the party see a large bonfire burning brightly upon a nearby hill. When they investigate, they find nothing but the bonfire—and a large black bear, smoking a pipe. ‘Welcome’, he rumbles. ‘Come and warm yourselves.’",
"A group of corbys attracted by the shiny thing they found. The players come across a casino golem (spilling coins everytime they crit) that they worship.",
"A gaggle(Hogwarts) of wizards has started putting arcane marks on people, kidnapping and placing them into a maze - they take bets on which gets to the end.",
"Two rival rangers are trying to hunt the same white stag, but they need the blessing of the fey lord in the area, players have to try and find the door to ask permission before they kill it.",
"The party comes across a small ravine, a seemingly perfect place for a bridge. But, there is no bridge in sight. The party can choose to scale the ravine... but there is actually a completely invisible bridge where the road ends and begins on the other side.",
"An undead dragon is searching for the party in a foggy swamp",
"A villa has a passerby that is keeping to himself, but ever since he arrived, strange \"lovecraftian\" occurrences began.",
"Desert nomads riding assorted large creatures are driven south due to something in the desert, they can trade, but with a knowledge check they might know they have a history of being raiders, using their creatures as mobile assault platforms.",
"While wondering through the woods, the party comes across what seems like an average Elven hunter who follows them on their adventures, but who later reveals himself as Corellon Larethian, god of the elves.",
"A gold coin with a brazier insignia, possibly from the City of Brass.",
"A flask half-buried in dirt, full of clean, fresh water.",
"A burned down hut at the side of the road. The hut is completely destroyed, but a perceptive character might notice a set of dice or a deck of cards in perfect condition among the rubble.",
"Signs of an ancient battle: armor, weapons, banners; overgrown and buried, but still visible.",
"A knife stuck into a tree. More knives in more trees deeper in the woods can lead a perceptive character to a hidden cache, picked clean a while back (perhaps by minions of the current BBEG).",
"Two figures blink into existence above the PCs' heads. They curse wildly and cast a few powerful spells at each other before disappearing once more. The PCs may or may not be caught in the crossfire.",
"A critter curses loudly as one of the players disturbs it. Should the players try to talk to it, it does its best to try and hide the fact that it was awakened by a local druidic circle for some (possibly sinister) purpose.",
"A body of a dead peasant by the side of the road with an empty glass bottle near it. No visible injuries, and the bottle still smells of alcohol.",
"A rusty old sword handle with beautiful gold engravings lies near the path. Picking the handle up immediately rusts the sword handle and the engravings turn black.",
"A perfectly circular patch of vegetation is missing from the surrounding area -- the ground is barren there. There are no traces of magic visible by detect magic or similar effects.",
"As the party walks (anything but an open plain) they hear humans yelling every now and then. Should they stay to find out or investigate further they will find a hunting party. Because good weapons are expensive not everyone from this party can afford one, therefore all the money have been pooled to make/get one/few weapons and the rest have formed a line to drive the animals towards the rangers.",
"Here once stood a smaller village or town, but it eas razed a while ago either by a war or by any other conflict. But because of an ongoing war (or other crisis) refugees have started taking residence here once more.",
"The party notices a shop on the roadside. Upon closer inspection they find out that it’s inhabited by a mad scientist. Here’s a list of some of his inventions: a) A swear. The man had an old shortsword lying around thought that it’s range was it’s shortcoming. So he put it on a long stick to increase it’s range. b) A two sided die. It’s a flat wooden construct with a 1 engraved on one side, and a 2 one the other. c) A magic crystall which can store magic, and upon activating it will release it. Because of it’s low quality it can’t tolerate anything stronger than a cantrip and they usually break upon use. It’s not uncommon for them to break from smaller shocks either, resulting in a small firecracker-esque explosion not even strong enough to harm a bird. However because of the crystals rich potassium and phospate content it can be used as the most excellent fertilizer. This also explains why the scientists garden is completely overgrown.",
"10 feet in front of the party a well-dressed gnome appears out of thin air and falls to the ground in a tumble of limbs and robes. He rights himself and notices you, he seems angry. \"Close... so damned close!\" he says, more to himself than you. If you inquire he will tell you he was inches from nabbing a very powerfull artifact. \"where?\" you might ask, in the Thuldanin layer of Archeron. Help him retrieve this artifact by stepping through a portal with him and he will reward you with a once-casting wish necklace, as well as returning you to where you were. ( he will not outright tell them the necklace grants 1 wish more like \"tell it what you need when your need is dire\" or something)",
"The party comes across a shady-looking individual carrying an egg wrapped up in a bundle of cloth. The individual tries desperately to sell the egg to the party for only 100 gp.",
"The party comes across a group of people standing around an ancient oak tree with an old, rusty-looking weapon imbedded into it. Some of the group are trying to pull out the weapon, to no avail.",
"The party is shaken by two thunderous roars. If the party looks up, they will see two different types of dragons having an airborne duel.",
"( this one is great if the party has a paladin or cleric in it) The party comes across a hooded traveller, who claims to just be an ordinary pilgrim. He might offer the party to dine with him/her, after which he or she starts a conversation with them. After a while, the traveller might start talking about things the paladin or cleric only disclosed in their prayers. When confronted with this, the traveller will smile, say one more thing, possibly a piece of advise or some kind of other cryptic message, and fade away, leaving only the cloak behind. The party is fully healed from having food with this individual.",
"As the party is walking through the forest, they hear a sword cutting into wood and someone crying with rage. If they go to take a closer look, they will see a young man dressed in plate armor angrily hacking at trees with his sword. He has tears in his eyes and shouts:\" I'll kill them, I'll kill them all!\".",
"They come across a forest made of stone and find a family of gorgons living inside, this family only has two members and lives in a house made of people turned to stone. On further investigation of the bodies or the home they find another room being prepared for children or signs of pregnancy.",
"A small bandit encampment in front of a cave, after killing them and the party explores it is revealed that they were mercenaries hired by an old blacksmith to keep him and his new pupils safe from his blacksmith rivals who want his secrets and demand they stay to guard them now.",
"A shady courier runs past the party and refuses to tell them what he is traveling with or what he is delivering, if they decide to kill him on suspicion they find nothing on him at all and he was just doing his job of not telling other his buissness for his clients. You could have him connected to a family of nobles and they are out to get the party now? Or have something important that belongs to someone else. If not it just remains a mystery.",
"If you make your party roll for events (I have good ones and bad ones set up) then if they roll poorly 3 times in a row you could use this one; find footprints of something large traveling in the same direction they are going (If they roll to find out what say it has worn away to much from time to tell) and then on the third one they run into an appropriately hard giant fight (should be hard) I had my party fight a storm giant.",
"They find a talking squirill who approaches them and claims to be a god trapped in an animal body. They think that if they die they will be freed and promise the party a favor for doing so. If they do it nothing happens except a woodpecker nearby stops and looks at the party, says \"Fuck\", and flies away. Upon a successful DC 25 perception check they find a very bored wizard amusing himself by messing with passerbys by pulling this trick, he is mostly harmless but very strong.",
"They find a tile on the ground that is carrot orange and covered in dust, it has a sign reading \"warning\" on it. If they pick it up, whoever does so turns into a carrot for exatly 5 seconds then turns back. They are not harmed by it. if it touches someone else on their bare skin nothing happens, it is now bound to the person who turned into a carrot, their dreams are normal but are only in an orange hue from now on. It is in their bag every morning but will not turn them into a carrot unless they touch it again. It does nothing else and they cannot find an owner.",
"A scream in middle of the day, just out of sight. When they get there they find the reminents of a recently cast fireball spell, if investigated. No other evidence remains and cannot find hide or hair of the caster.",
"A lone hunter carrying many dog skulls around his belt comes out of the forest in front of the players, he stands in front of them and is dirty, messy, kinda crazy looking, and very very well armed. He approaches the party and stares into their eyes, crouching for halflings and gnomes, and on tiptoes for goliaths or firbolgs about 5 inches from them. After this, he moves on without a word into the forest again. If they follow him all day and share his camp he will ask them to do the same to him, and if they see a worm in his eye, please kill him, they will not find one and he will sigh saying \"I was so worried.\" and then wish the party good luck and leave. If they try and follow this time he has vanished. but find a \"shelter\" spell cast around the campsite and a freshly cut and cooked deer where he disappeared with a note \"Thank you. Watch for worms in the eyes\". They never see him again. (If you cannot tell by this point I really like to mess with my players for no reason.)",
"A peaceful walk turns sour when the players hear a rumbling, and from a hill nearby a huge, shitty made, goblin siege tower rumbles into view, full of rampaging goblins spouting nonsence, wanting food and loot, and screaming profanities, they fail to notice all their jumping has made the tower wobble and it falls down, very comidically, so that a lone goblin falls into the middle of the adventuring party very sheepishly. Takes off his white shirt and waves it, if they let him go he runs screaming toward the way the tower came from, if they kill him nothing happens and they find 6 copper. If they spend time to loot the tower they find nothing of use... these goblins had nothing to start with.",
"Now for a good one, The players come across an oasis. This can be in a forest, desert, plains, wherever. It has tropical trees and a lovely smell and look. Upon further inspection a druid of (your race of choice) runs out and begs them to not step foot in the pond. This is the guardian of this pond, and he may be small now but will grow to protect this whole (forest, plains, desert, what have you) because this druid and her circle of (your nature god of choice) has commanded it to be done. However they announce they are pacifists and it is up to the adventurers if they wish to fight the small spirit or not for its power. If not they druids thank them by offering them a decantor of endless water, 100 days worth of rations, or a custom made bag of holding that looks woven from the area of choice. If they choose to fight it it has the stats of a very challenging beast. (For my party that was a Giant Crocodile with 3 legendary resistances, I would recommend tuning it up to be very hard). If they kill it they are rewarded with its hide, for me it was a giant albino aligator skin that became a Cloak of protection with an alligator head cowl. You can scale this up or down but make it intresting with legendary actions or resitance, gives it the feel of a guardian spirit. If they lose well... they die. The druids shun them after this and if they come back to this area they will find it burned, or still a desert, or taken over by industry, something to make the players feel kinda bummed. Or if you want you can have that spirit have an egg that hatches right as its predicessor dies and is very small, you could squish it, but if the players ignore this one the area could be the same when they come back, if they take it with them or kill it they get nothing (Or a cool spirit pet, my players didnt do that so better come up with something if you do this sorry). Hope these 10 help! Sorry if they were a bit long."
    ]
}
